Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0512mcf064.h
extern volatile __IPC55bits_t IPC55bits __asm__ ("IPC55") __attribute__((section("sfrs"), address(0xBF8104B0)));
extern volatile uint32_t        IPC55CLR __attribute__((section("sfrs"),address(0xBF8104B4)));
extern volatile uint32_t        IPC55SET __attribute__((section("sfrs"),address(0xBF8104B8)));
extern volatile uint32_t        IPC55INV __attribute__((section("sfrs"),address(0xBF8104BC)));
#define IPC56 IPC56
extern volatile uint32_t   IPC56 __attribute__((section("sfrs"), address(0xBF8104C0)));
typedef union {
  struct {
    uint32_t SPI5EIS:2;
    uint32_t SPI5EIP:3;
    uint32_t :3;
    uint32_t SPI5RXIS:2;
    uint32_t SPI5RXIP:3;
    uint32_t :3;
    uint32_t SPI5TXIS:2;
    uint32_t SPI5TXIP:3;
    uint32_t :3;
    uint32_t SPI6EIS:2;
    uint32_t SPI6EIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC56bits_t;
extern volatile __IPC56bits_t IPC56bits __asm__ ("IPC56") __attribute__((section("sfrs"), address(0xBF8104C0)));
extern volatile uint32_t        IPC56CLR __attribute__((section("sfrs"),address(0xBF8104C4)));
extern volatile uint32_t        IPC56SET __attribute__((section("sfrs"),address(0xBF8104C8)));
extern volatile uint32_t        IPC56INV __attribute__((section("sfrs"),address(0xBF8104CC)));
#define IPC57 IPC57
extern volatile uint32_t   IPC57 __attribute__((section("sfrs"), address(0xBF8104D0)));
typedef union {
  struct {
    uint32_t SPI6RXIS:2;
    uint32_t SPI6RXIP:3;
    uint32_t :3;
    uint32_t SPI6TXIS:2;
    uint32_t SPI6TXIP:3;
    uint32_t :3;
    uint32_t SBIS:2;
    uint32_t SBIP:3;
    uint32_t :3;
    uint32_t PTGSTEPIS:2;
    uint32_t PTGSTEPIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC57bits_t;
extern volatile __IPC57bits_t IPC57bits __asm__ ("IPC57") __attribute__((section("sfrs"), address(0xBF8104D0)));
extern volatile uint32_t        IPC57CLR __attribute__((section("sfrs"),address(0xBF8104D4)));
extern volatile uint32_t        IPC57SET __attribute__((section("sfrs"),address(0xBF8104D8)));
extern volatile uint32_t        IPC57INV __attribute__((section("sfrs"),address(0xBF8104DC)));
#define IPC59 IPC59
extern volatile uint32_t   IPC59 __attribute__((section("sfrs"), address(0xBF8104F0)));
typedef union {
  struct {
    uint32_t :16;
    uint32_t PWM7IS:2;
    uint32_t PWM7IP:3;
    uint32_t :3;
    uint32_t PWM8IS:2;
    uint32_t PWM8IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC59bits_t;
extern volatile __IPC59bits_t IPC59bits __asm__ ("IPC59") __attribute__((section("sfrs"), address(0xBF8104F0)));
extern volatile uint32_t        IPC59CLR __attribute__((section("sfrs"),address(0xBF8104F4)));
extern volatile uint32_t        IPC59SET __attribute__((section("sfrs"),address(0xBF8104F8)));
extern volatile uint32_t        IPC59INV __attribute__((section("sfrs"),address(0xBF8104FC)));
#define IPC60 IPC60
extern volatile uint32_t   IPC60 __attribute__((section("sfrs"), address(0xBF810500)));
typedef union {
  struct {
    uint32_t PWM9IS:2;
    uint32_t PWM9IP:3;
    uint32_t :3;
    uint32_t PWM10IS:2;
    uint32_t PWM10IP:3;
    uint32_t :3;
    uint32_t PWM11IS:2;
    uint32_t PWM11IP:3;
    uint32_t :3;
    uint32_t PWM12IS:2;
    uint32_t PWM12IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC60bits_t;
extern volatile __IPC60bits_t IPC60bits __asm__ ("IPC60") __attribute__((section("sfrs"), address(0xBF810500)));
extern volatile uint32_t        IPC60CLR __attribute__((section("sfrs"),address(0xBF810504)));
extern volatile uint32_t        IPC60SET __attribute__((section("sfrs"),address(0xBF810508)));
extern volatile uint32_t        IPC60INV __attribute__((section("sfrs"),address(0xBF81050C)));
#define IPC61 IPC61
extern volatile uint32_t   IPC61 __attribute__((section("sfrs"), address(0xBF810510)));
typedef union {
  struct {
    uint32_t USB2IS:2;
    uint32_t USB2IP:3;
    uint32_t :3;
    uint32_t AD1DC3IS:2;
    uint32_t AD1DC3IP:3;
    uint32_t :3;
    uint32_t AD1DC4IS:2;
    uint32_t AD1DC4IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC61bits_t;
extern volatile __IPC61bits_t IPC61bits __asm__ ("IPC61") __attribute__((section("sfrs"), address(0xBF810510)));
extern volatile uint32_t        IPC61CLR __attribute__((section("sfrs"),address(0xBF810514)));
extern volatile uint32_t        IPC61SET __attribute__((section("sfrs"),address(0xBF810518)));
extern volatile uint32_t        IPC61INV __attribute__((section("sfrs"),address(0xBF81051C)));
#define IPC63 IPC63
extern volatile uint32_t   IPC63 __attribute__((section("sfrs"), address(0xBF810530)));
typedef union {
  struct {
    uint32_t :16;
    uint32_t CPCIS:2;
    uint32_t CPCIP:3;
    uint32_t :3;
    uint32_t CFDCIS:2;
    uint32_t CFDCIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC63bits_t;
extern volatile __IPC63bits_t IPC63bits __asm__ ("IPC63") __attribute__((section("sfrs"), address(0xBF810530)));
extern volatile uint32_t        IPC63CLR __attribute__((section("sfrs"),address(0xBF810534)));
extern volatile uint32_t        IPC63SET __attribute__((section("sfrs"),address(0xBF810538)));
extern volatile uint32_t        IPC63INV __attribute__((section("sfrs"),address(0xBF81053C)));
#define OFF000 OFF000
extern volatile uint32_t   OFF000 __attribute__((section("sfrs"), address(0xBF810540)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF000bits_t;
extern volatile __OFF000bits_t OFF000bits __asm__ ("OFF000") __attribute__((section("sfrs"), address(0xBF810540)));
#define OFF001 OFF001
extern volatile uint32_t   OFF001 __attribute__((section("sfrs"), address(0xBF810544)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF001bits_t;
extern volatile __OFF001bits_t OFF001bits __asm__ ("OFF001") __attribute__((section("sfrs"), address(0xBF810544)));
#define OFF002 OFF002
extern volatile uint32_t   OFF002 __attribute__((section("sfrs"), address(0xBF810548)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF002bits_t;
extern volatile __OFF002bits_t OFF002bits __asm__ ("OFF002") __attribute__((section("sfrs"), address(0xBF810548)));
#define OFF003 OFF003
extern volatile uint32_t   OFF003 __attribute__((section("sfrs"), address(0xBF81054C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF003bits_t;
extern volatile __OFF003bits_t OFF003bits __asm__ ("OFF003") __attribute__((section("sfrs"), address(0xBF81054C)));
#define OFF004 OFF004
extern volatile uint32_t   OFF004 __attribute__((section("sfrs"), address(0xBF810550)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF004bits_t;
extern volatile __OFF004bits_t OFF004bits __asm__ ("OFF004") __attribute__((section("sfrs"), address(0xBF810550)));
#define OFF005 OFF005
extern volatile uint32_t   OFF005 __attribute__((section("sfrs"), address(0xBF810554)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF005bits_t;
extern volatile __OFF005bits_t OFF005bits __asm__ ("OFF005") __attribute__((section("sfrs"), address(0xBF810554)));
#define OFF006 OFF006
extern volatile uint32_t   OFF006 __attribute__((section("sfrs"), address(0xBF810558)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF006bits_t;
extern volatile __OFF006bits_t OFF006bits __asm__ ("OFF006") __attribute__((section("sfrs"), address(0xBF810558)));
#define OFF007 OFF007
extern volatile uint32_t   OFF007 __attribute__((section("sfrs"), address(0xBF81055C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF007bits_t;
extern volatile __OFF007bits_t OFF007bits __asm__ ("OFF007") __attribute__((section("sfrs"), address(0xBF81055C)));
#define OFF008 OFF008
extern volatile uint32_t   OFF008 __attribute__((section("sfrs"), address(0xBF810560)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF008bits_t;
extern volatile __OFF008bits_t OFF008bits __asm__ ("OFF008") __attribute__((section("sfrs"), address(0xBF810560)));
#define OFF009 OFF009
extern volatile uint32_t   OFF009 __attribute__((section("sfrs"), address(0xBF810564)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF009bits_t;
