Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0512mcf064.h
extern volatile __OFF203bits_t OFF203bits __asm__ ("OFF203") __attribute__((section("sfrs"), address(0xBF81086C)));
#define OFF204 OFF204
extern volatile uint32_t   OFF204 __attribute__((section("sfrs"), address(0xBF810870)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF204bits_t;
extern volatile __OFF204bits_t OFF204bits __asm__ ("OFF204") __attribute__((section("sfrs"), address(0xBF810870)));
#define OFF205 OFF205
extern volatile uint32_t   OFF205 __attribute__((section("sfrs"), address(0xBF810874)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF205bits_t;
extern volatile __OFF205bits_t OFF205bits __asm__ ("OFF205") __attribute__((section("sfrs"), address(0xBF810874)));
#define OFF206 OFF206
extern volatile uint32_t   OFF206 __attribute__((section("sfrs"), address(0xBF810878)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF206bits_t;
extern volatile __OFF206bits_t OFF206bits __asm__ ("OFF206") __attribute__((section("sfrs"), address(0xBF810878)));
#define OFF207 OFF207
extern volatile uint32_t   OFF207 __attribute__((section("sfrs"), address(0xBF81087C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF207bits_t;
extern volatile __OFF207bits_t OFF207bits __asm__ ("OFF207") __attribute__((section("sfrs"), address(0xBF81087C)));
#define OFF208 OFF208
extern volatile uint32_t   OFF208 __attribute__((section("sfrs"), address(0xBF810880)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF208bits_t;
extern volatile __OFF208bits_t OFF208bits __asm__ ("OFF208") __attribute__((section("sfrs"), address(0xBF810880)));
#define OFF209 OFF209
extern volatile uint32_t   OFF209 __attribute__((section("sfrs"), address(0xBF810884)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF209bits_t;
extern volatile __OFF209bits_t OFF209bits __asm__ ("OFF209") __attribute__((section("sfrs"), address(0xBF810884)));
#define OFF210 OFF210
extern volatile uint32_t   OFF210 __attribute__((section("sfrs"), address(0xBF810888)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF210bits_t;
extern volatile __OFF210bits_t OFF210bits __asm__ ("OFF210") __attribute__((section("sfrs"), address(0xBF810888)));
#define OFF211 OFF211
extern volatile uint32_t   OFF211 __attribute__((section("sfrs"), address(0xBF81088C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF211bits_t;
extern volatile __OFF211bits_t OFF211bits __asm__ ("OFF211") __attribute__((section("sfrs"), address(0xBF81088C)));
#define OFF212 OFF212
extern volatile uint32_t   OFF212 __attribute__((section("sfrs"), address(0xBF810890)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF212bits_t;
extern volatile __OFF212bits_t OFF212bits __asm__ ("OFF212") __attribute__((section("sfrs"), address(0xBF810890)));
#define OFF213 OFF213
extern volatile uint32_t   OFF213 __attribute__((section("sfrs"), address(0xBF810894)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF213bits_t;
extern volatile __OFF213bits_t OFF213bits __asm__ ("OFF213") __attribute__((section("sfrs"), address(0xBF810894)));
#define OFF214 OFF214
extern volatile uint32_t   OFF214 __attribute__((section("sfrs"), address(0xBF810898)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF214bits_t;
extern volatile __OFF214bits_t OFF214bits __asm__ ("OFF214") __attribute__((section("sfrs"), address(0xBF810898)));
#define OFF215 OFF215
extern volatile uint32_t   OFF215 __attribute__((section("sfrs"), address(0xBF81089C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF215bits_t;
extern volatile __OFF215bits_t OFF215bits __asm__ ("OFF215") __attribute__((section("sfrs"), address(0xBF81089C)));
#define OFF216 OFF216
extern volatile uint32_t   OFF216 __attribute__((section("sfrs"), address(0xBF8108A0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF216bits_t;
extern volatile __OFF216bits_t OFF216bits __asm__ ("OFF216") __attribute__((section("sfrs"), address(0xBF8108A0)));
#define OFF217 OFF217
extern volatile uint32_t   OFF217 __attribute__((section("sfrs"), address(0xBF8108A4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF217bits_t;
extern volatile __OFF217bits_t OFF217bits __asm__ ("OFF217") __attribute__((section("sfrs"), address(0xBF8108A4)));
#define OFF218 OFF218
extern volatile uint32_t   OFF218 __attribute__((section("sfrs"), address(0xBF8108A8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF218bits_t;
extern volatile __OFF218bits_t OFF218bits __asm__ ("OFF218") __attribute__((section("sfrs"), address(0xBF8108A8)));
#define OFF219 OFF219
extern volatile uint32_t   OFF219 __attribute__((section("sfrs"), address(0xBF8108AC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF219bits_t;
extern volatile __OFF219bits_t OFF219bits __asm__ ("OFF219") __attribute__((section("sfrs"), address(0xBF8108AC)));
#define OFF220 OFF220
extern volatile uint32_t   OFF220 __attribute__((section("sfrs"), address(0xBF8108B0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF220bits_t;
extern volatile __OFF220bits_t OFF220bits __asm__ ("OFF220") __attribute__((section("sfrs"), address(0xBF8108B0)));
#define OFF221 OFF221
extern volatile uint32_t   OFF221 __attribute__((section("sfrs"), address(0xBF8108B4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF221bits_t;
extern volatile __OFF221bits_t OFF221bits __asm__ ("OFF221") __attribute__((section("sfrs"), address(0xBF8108B4)));
#define OFF222 OFF222
extern volatile uint32_t   OFF222 __attribute__((section("sfrs"), address(0xBF8108B8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF222bits_t;
extern volatile __OFF222bits_t OFF222bits __asm__ ("OFF222") __attribute__((section("sfrs"), address(0xBF8108B8)));
#define OFF223 OFF223
extern volatile uint32_t   OFF223 __attribute__((section("sfrs"), address(0xBF8108BC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF223bits_t;
extern volatile __OFF223bits_t OFF223bits __asm__ ("OFF223") __attribute__((section("sfrs"), address(0xBF8108BC)));
#define OFF224 OFF224
extern volatile uint32_t   OFF224 __attribute__((section("sfrs"), address(0xBF8108C0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF224bits_t;
extern volatile __OFF224bits_t OFF224bits __asm__ ("OFF224") __attribute__((section("sfrs"), address(0xBF8108C0)));
#define OFF225 OFF225
extern volatile uint32_t   OFF225 __attribute__((section("sfrs"), address(0xBF8108C4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF225bits_t;
extern volatile __OFF225bits_t OFF225bits __asm__ ("OFF225") __attribute__((section("sfrs"), address(0xBF8108C4)));
#define OFF226 OFF226
extern volatile uint32_t   OFF226 __attribute__((section("sfrs"), address(0xBF8108C8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF226bits_t;
extern volatile __OFF226bits_t OFF226bits __asm__ ("OFF226") __attribute__((section("sfrs"), address(0xBF8108C8)));
#define OFF227 OFF227
extern volatile uint32_t   OFF227 __attribute__((section("sfrs"), address(0xBF8108CC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF227bits_t;
