Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0512mcf064.h
extern volatile __DCH7CSIZbits_t DCH7CSIZbits __asm__ ("DCH7CSIZ") __attribute__((section("sfrs"), address(0xBF811630)));
extern volatile uint32_t        DCH7CSIZCLR __attribute__((section("sfrs"),address(0xBF811634)));
extern volatile uint32_t        DCH7CSIZSET __attribute__((section("sfrs"),address(0xBF811638)));
extern volatile uint32_t        DCH7CSIZINV __attribute__((section("sfrs"),address(0xBF81163C)));
#define DCH7CPTR DCH7CPTR
extern volatile uint32_t   DCH7CPTR __attribute__((section("sfrs"), address(0xBF811640)));
typedef struct {
  uint32_t CHCPTR:16;
} __DCH7CPTRbits_t;
extern volatile __DCH7CPTRbits_t DCH7CPTRbits __asm__ ("DCH7CPTR") __attribute__((section("sfrs"), address(0xBF811640)));
#define DCS7CPTR DCS7CPTR
extern volatile uint32_t   DCS7CPTR __attribute__((section("sfrs"), address(0xBF811640)));
typedef struct {
  uint32_t CHCPTR:16;
} __DCS7CPTRbits_t;
extern volatile __DCS7CPTRbits_t DCS7CPTRbits __asm__ ("DCS7CPTR") __attribute__((section("sfrs"), address(0xBF811640)));
extern volatile uint32_t        DCH7CPTRCLR __attribute__((section("sfrs"),address(0xBF811644)));
extern volatile uint32_t        DCS7CPTRCLR __attribute__((section("sfrs"),address(0xBF811644)));
extern volatile uint32_t        DCH7CPTRSET __attribute__((section("sfrs"),address(0xBF811648)));
extern volatile uint32_t        DCS7CPTRSET __attribute__((section("sfrs"),address(0xBF811648)));
extern volatile uint32_t        DCH7CPTRINV __attribute__((section("sfrs"),address(0xBF81164C)));
extern volatile uint32_t        DCS7CPTRINV __attribute__((section("sfrs"),address(0xBF81164C)));
#define DCH7DAT DCH7DAT
extern volatile uint32_t   DCH7DAT __attribute__((section("sfrs"), address(0xBF811650)));
typedef struct {
  uint32_t CHPDAT:16;
} __DCH7DATbits_t;
extern volatile __DCH7DATbits_t DCH7DATbits __asm__ ("DCH7DAT") __attribute__((section("sfrs"), address(0xBF811650)));
extern volatile uint32_t        DCH7DATCLR __attribute__((section("sfrs"),address(0xBF811654)));
extern volatile uint32_t        DCH7DATSET __attribute__((section("sfrs"),address(0xBF811658)));
extern volatile uint32_t        DCH7DATINV __attribute__((section("sfrs"),address(0xBF81165C)));
#define T1CON T1CON
extern volatile uint32_t   T1CON __attribute__((section("sfrs"), address(0xBF820000)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t TCS:1;
    uint32_t TSYNC:1;
    uint32_t :1;
    uint32_t TCKPS:2;
    uint32_t :1;
    uint32_t TGATE:1;
    uint32_t TECS:2;
    uint32_t :1;
    uint32_t TWIP:1;
    uint32_t TWDIS:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :4;
    uint32_t TCKPS0:1;
    uint32_t TCKPS1:1;
    uint32_t :2;
    uint32_t TECS0:1;
    uint32_t TECS1:1;
  };
  struct {
    uint32_t :13;
    uint32_t TSIDL:1;
    uint32_t :1;
    uint32_t TON:1;
  };
  struct {
    uint32_t w:32;
  };
} __T1CONbits_t;
extern volatile __T1CONbits_t T1CONbits __asm__ ("T1CON") __attribute__((section("sfrs"), address(0xBF820000)));
extern volatile uint32_t        T1CONCLR __attribute__((section("sfrs"),address(0xBF820004)));
extern volatile uint32_t        T1CONSET __attribute__((section("sfrs"),address(0xBF820008)));
extern volatile uint32_t        T1CONINV __attribute__((section("sfrs"),address(0xBF82000C)));
#define TMR1 TMR1
extern volatile uint32_t   TMR1 __attribute__((section("sfrs"), address(0xBF820010)));
extern volatile uint32_t        TMR1CLR __attribute__((section("sfrs"),address(0xBF820014)));
extern volatile uint32_t        TMR1SET __attribute__((section("sfrs"),address(0xBF820018)));
extern volatile uint32_t        TMR1INV __attribute__((section("sfrs"),address(0xBF82001C)));
#define PR1 PR1
extern volatile uint32_t   PR1 __attribute__((section("sfrs"), address(0xBF820020)));
extern volatile uint32_t        PR1CLR __attribute__((section("sfrs"),address(0xBF820024)));
extern volatile uint32_t        PR1SET __attribute__((section("sfrs"),address(0xBF820028)));
extern volatile uint32_t        PR1INV __attribute__((section("sfrs"),address(0xBF82002C)));
#define T2CON T2CON
extern volatile uint32_t   T2CON __attribute__((section("sfrs"), address(0xBF820200)));
typedef struct {
  uint32_t :1;
  uint32_t TCS:1;
  uint32_t :1;
  uint32_t T32:1;
  uint32_t TCKPS:3;
  uint32_t TGATE:1;
  uint32_t SYNC:1;
  uint32_t :4;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
} __T2CONbits_t;
extern volatile __T2CONbits_t T2CONbits __asm__ ("T2CON") __attribute__((section("sfrs"), address(0xBF820200)));
extern volatile uint32_t        T2CONCLR __attribute__((section("sfrs"),address(0xBF820204)));
extern volatile uint32_t        T2CONSET __attribute__((section("sfrs"),address(0xBF820208)));
extern volatile uint32_t        T2CONINV __attribute__((section("sfrs"),address(0xBF82020C)));
#define TMR2 TMR2
extern volatile uint32_t   TMR2 __attribute__((section("sfrs"), address(0xBF820210)));
extern volatile uint32_t        TMR2CLR __attribute__((section("sfrs"),address(0xBF820214)));
extern volatile uint32_t        TMR2SET __attribute__((section("sfrs"),address(0xBF820218)));
extern volatile uint32_t        TMR2INV __attribute__((section("sfrs"),address(0xBF82021C)));
#define PR2 PR2
extern volatile uint32_t   PR2 __attribute__((section("sfrs"), address(0xBF820220)));
extern volatile uint32_t        PR2CLR __attribute__((section("sfrs"),address(0xBF820224)));
extern volatile uint32_t        PR2SET __attribute__((section("sfrs"),address(0xBF820228)));
extern volatile uint32_t        PR2INV __attribute__((section("sfrs"),address(0xBF82022C)));
#define T3CON T3CON
extern volatile uint32_t   T3CON __attribute__((section("sfrs"), address(0xBF820400)));
typedef struct {
  uint32_t :1;
  uint32_t TCS:1;
  uint32_t :1;
  uint32_t T32:1;
  uint32_t TCKPS:3;
  uint32_t TGATE:1;
  uint32_t SYNC:1;
  uint32_t :4;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
} __T3CONbits_t;
extern volatile __T3CONbits_t T3CONbits __asm__ ("T3CON") __attribute__((section("sfrs"), address(0xBF820400)));
extern volatile uint32_t        T3CONCLR __attribute__((section("sfrs"),address(0xBF820404)));
extern volatile uint32_t        T3CONSET __attribute__((section("sfrs"),address(0xBF820408)));
extern volatile uint32_t        T3CONINV __attribute__((section("sfrs"),address(0xBF82040C)));
#define TMR3 TMR3
extern volatile uint32_t   TMR3 __attribute__((section("sfrs"), address(0xBF820410)));
extern volatile uint32_t        TMR3CLR __attribute__((section("sfrs"),address(0xBF820414)));
extern volatile uint32_t        TMR3SET __attribute__((section("sfrs"),address(0xBF820418)));
extern volatile uint32_t        TMR3INV __attribute__((section("sfrs"),address(0xBF82041C)));
#define PR3 PR3
extern volatile uint32_t   PR3 __attribute__((section("sfrs"), address(0xBF820420)));
extern volatile uint32_t        PR3CLR __attribute__((section("sfrs"),address(0xBF820424)));
extern volatile uint32_t        PR3SET __attribute__((section("sfrs"),address(0xBF820428)));
extern volatile uint32_t        PR3INV __attribute__((section("sfrs"),address(0xBF82042C)));
#define T4CON T4CON
extern volatile uint32_t   T4CON __attribute__((section("sfrs"), address(0xBF820600)));
typedef struct {
  uint32_t :1;
  uint32_t TCS:1;
  uint32_t :1;
  uint32_t T32:1;
  uint32_t TCKPS:3;
  uint32_t TGATE:1;
  uint32_t SYNC:1;
  uint32_t :4;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
} __T4CONbits_t;
