Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0512mcf064.h
extern volatile __CAP9bits_t CAP9bits __asm__ ("CAP9") __attribute__((section("sfrs"), address(0xBF82A970)));
extern volatile uint32_t        CAP9CLR __attribute__((section("sfrs"),address(0xBF82A974)));
extern volatile uint32_t        CAP9SET __attribute__((section("sfrs"),address(0xBF82A978)));
extern volatile uint32_t        CAP9INV __attribute__((section("sfrs"),address(0xBF82A97C)));
#define LEBCON9 LEBCON9
extern volatile uint32_t   LEBCON9 __attribute__((section("sfrs"), address(0xBF82A980)));
typedef struct {
  uint32_t :10;
  uint32_t CLLEBEN:1;
  uint32_t FLTLEBEN:1;
  uint32_t PLF:1;
  uint32_t PLR:1;
  uint32_t PHF:1;
  uint32_t PHR:1;
} __LEBCON9bits_t;
extern volatile __LEBCON9bits_t LEBCON9bits __asm__ ("LEBCON9") __attribute__((section("sfrs"), address(0xBF82A980)));
extern volatile uint32_t        LEBCON9CLR __attribute__((section("sfrs"),address(0xBF82A984)));
extern volatile uint32_t        LEBCON9SET __attribute__((section("sfrs"),address(0xBF82A988)));
extern volatile uint32_t        LEBCON9INV __attribute__((section("sfrs"),address(0xBF82A98C)));
#define LEBDLY9 LEBDLY9
extern volatile uint32_t   LEBDLY9 __attribute__((section("sfrs"), address(0xBF82A990)));
typedef struct {
  uint32_t LEB:12;
} __LEBDLY9bits_t;
extern volatile __LEBDLY9bits_t LEBDLY9bits __asm__ ("LEBDLY9") __attribute__((section("sfrs"), address(0xBF82A990)));
extern volatile uint32_t        LEBDLY9CLR __attribute__((section("sfrs"),address(0xBF82A994)));
extern volatile uint32_t        LEBDLY9SET __attribute__((section("sfrs"),address(0xBF82A998)));
extern volatile uint32_t        LEBDLY9INV __attribute__((section("sfrs"),address(0xBF82A99C)));
#define AUXCON9 AUXCON9
extern volatile uint32_t   AUXCON9 __attribute__((section("sfrs"), address(0xBF82A9A0)));
typedef struct {
  uint32_t CHOPLEN:1;
  uint32_t CHOPHEN:1;
  uint32_t CHOPSEL:4;
} __AUXCON9bits_t;
extern volatile __AUXCON9bits_t AUXCON9bits __asm__ ("AUXCON9") __attribute__((section("sfrs"), address(0xBF82A9A0)));
extern volatile uint32_t        AUXCON9CLR __attribute__((section("sfrs"),address(0xBF82A9A4)));
extern volatile uint32_t        AUXCON9SET __attribute__((section("sfrs"),address(0xBF82A9A8)));
extern volatile uint32_t        AUXCON9INV __attribute__((section("sfrs"),address(0xBF82A9AC)));
#define PTMR9 PTMR9
extern volatile uint32_t   PTMR9 __attribute__((section("sfrs"), address(0xBF82A9B0)));
typedef struct {
  uint32_t TMR:16;
} __PTMR9bits_t;
extern volatile __PTMR9bits_t PTMR9bits __asm__ ("PTMR9") __attribute__((section("sfrs"), address(0xBF82A9B0)));
extern volatile uint32_t        PTMR9CLR __attribute__((section("sfrs"),address(0xBF82A9B4)));
extern volatile uint32_t        PTMR9SET __attribute__((section("sfrs"),address(0xBF82A9B8)));
extern volatile uint32_t        PTMR9INV __attribute__((section("sfrs"),address(0xBF82A9BC)));
#define PWMCON10 PWMCON10
extern volatile uint32_t   PWMCON10 __attribute__((section("sfrs"), address(0xBF82A9C0)));
typedef struct {
  uint32_t :1;
  uint32_t XPRES:1;
  uint32_t :1;
  uint32_t MTBS:1;
  uint32_t PTDIR:1;
  uint32_t DTCP:1;
  uint32_t DTC:2;
  uint32_t :1;
  uint32_t ITB:1;
  uint32_t ECAM:2;
  uint32_t :2;
  uint32_t CLTSTAT:1;
  uint32_t FLTSTAT:1;
  uint32_t :3;
  uint32_t PWMHIEN:1;
  uint32_t PWMLIEN:1;
  uint32_t TRGIEN:1;
  uint32_t CLIEN:1;
  uint32_t FLTIEN:1;
  uint32_t :3;
  uint32_t PWMHIF:1;
  uint32_t PWMLIF:1;
  uint32_t TRGIF:1;
  uint32_t CLIF:1;
  uint32_t FLTIF:1;
} __PWMCON10bits_t;
extern volatile __PWMCON10bits_t PWMCON10bits __asm__ ("PWMCON10") __attribute__((section("sfrs"), address(0xBF82A9C0)));
extern volatile uint32_t        PWMCON10CLR __attribute__((section("sfrs"),address(0xBF82A9C4)));
extern volatile uint32_t        PWMCON10SET __attribute__((section("sfrs"),address(0xBF82A9C8)));
extern volatile uint32_t        PWMCON10INV __attribute__((section("sfrs"),address(0xBF82A9CC)));
#define IOCON10 IOCON10
extern volatile uint32_t   IOCON10 __attribute__((section("sfrs"), address(0xBF82A9D0)));
typedef struct {
  uint32_t OSYNC:1;
  uint32_t SWAP:1;
  uint32_t CLDAT:2;
  uint32_t FLTDAT:2;
  uint32_t OVRDAT:2;
  uint32_t OVRENL:1;
  uint32_t OVRENH:1;
  uint32_t PMOD:2;
  uint32_t POLL:1;
  uint32_t POLH:1;
  uint32_t PENL:1;
  uint32_t PENH:1;
  uint32_t FLTMOD:2;
  uint32_t FLTPOL:1;
  uint32_t FLTSRC:4;
  uint32_t :1;
  uint32_t CLMOD:1;
  uint32_t CLPOL:1;
  uint32_t CLSRC:4;
} __IOCON10bits_t;
extern volatile __IOCON10bits_t IOCON10bits __asm__ ("IOCON10") __attribute__((section("sfrs"), address(0xBF82A9D0)));
extern volatile uint32_t        IOCON10CLR __attribute__((section("sfrs"),address(0xBF82A9D4)));
extern volatile uint32_t        IOCON10SET __attribute__((section("sfrs"),address(0xBF82A9D8)));
extern volatile uint32_t        IOCON10INV __attribute__((section("sfrs"),address(0xBF82A9DC)));
#define PDC10 PDC10
extern volatile uint32_t   PDC10 __attribute__((section("sfrs"), address(0xBF82A9E0)));
typedef struct {
  uint32_t PDC:16;
} __PDC10bits_t;
extern volatile __PDC10bits_t PDC10bits __asm__ ("PDC10") __attribute__((section("sfrs"), address(0xBF82A9E0)));
extern volatile uint32_t        PDC10CLR __attribute__((section("sfrs"),address(0xBF82A9E4)));
extern volatile uint32_t        PDC10SET __attribute__((section("sfrs"),address(0xBF82A9E8)));
extern volatile uint32_t        PDC10INV __attribute__((section("sfrs"),address(0xBF82A9EC)));
#define SDC10 SDC10
extern volatile uint32_t   SDC10 __attribute__((section("sfrs"), address(0xBF82A9F0)));
typedef struct {
  uint32_t SDC:16;
} __SDC10bits_t;
extern volatile __SDC10bits_t SDC10bits __asm__ ("SDC10") __attribute__((section("sfrs"), address(0xBF82A9F0)));
extern volatile uint32_t        SDC10CLR __attribute__((section("sfrs"),address(0xBF82A9F4)));
extern volatile uint32_t        SDC10SET __attribute__((section("sfrs"),address(0xBF82A9F8)));
extern volatile uint32_t        SDC10INV __attribute__((section("sfrs"),address(0xBF82A9FC)));
#define PHASE10 PHASE10
extern volatile uint32_t   PHASE10 __attribute__((section("sfrs"), address(0xBF82AA00)));
typedef struct {
  uint32_t PHASE:16;
} __PHASE10bits_t;
extern volatile __PHASE10bits_t PHASE10bits __asm__ ("PHASE10") __attribute__((section("sfrs"), address(0xBF82AA00)));
extern volatile uint32_t        PHASE10CLR __attribute__((section("sfrs"),address(0xBF82AA04)));
extern volatile uint32_t        PHASE10SET __attribute__((section("sfrs"),address(0xBF82AA08)));
extern volatile uint32_t        PHASE10INV __attribute__((section("sfrs"),address(0xBF82AA0C)));
#define DTR10 DTR10
extern volatile uint32_t   DTR10 __attribute__((section("sfrs"), address(0xBF82AA10)));
typedef struct {
  uint32_t DTR:16;
} __DTR10bits_t;
