Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0512mcf064.h
extern volatile __C1RXM2bits_t C1RXM2bits __asm__ ("C1RXM2") __attribute__((section("sfrs"), address(0xBF8800A0)));
extern volatile uint32_t        C1RXM2CLR __attribute__((section("sfrs"),address(0xBF8800A4)));
extern volatile uint32_t        C1RXM2SET __attribute__((section("sfrs"),address(0xBF8800A8)));
extern volatile uint32_t        C1RXM2INV __attribute__((section("sfrs"),address(0xBF8800AC)));
#define C1RXM3 C1RXM3
extern volatile uint32_t   C1RXM3 __attribute__((section("sfrs"), address(0xBF8800B0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t MIDE:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXM3bits_t;
extern volatile __C1RXM3bits_t C1RXM3bits __asm__ ("C1RXM3") __attribute__((section("sfrs"), address(0xBF8800B0)));
extern volatile uint32_t        C1RXM3CLR __attribute__((section("sfrs"),address(0xBF8800B4)));
extern volatile uint32_t        C1RXM3SET __attribute__((section("sfrs"),address(0xBF8800B8)));
extern volatile uint32_t        C1RXM3INV __attribute__((section("sfrs"),address(0xBF8800BC)));
#define C1FLTCON0 C1FLTCON0
extern volatile uint32_t   C1FLTCON0 __attribute__((section("sfrs"), address(0xBF8800C0)));
typedef union {
  struct {
    uint32_t FSEL0:5;
    uint32_t MSEL0:2;
    uint32_t FLTEN0:1;
    uint32_t FSEL1:5;
    uint32_t MSEL1:2;
    uint32_t FLTEN1:1;
    uint32_t FSEL2:5;
    uint32_t MSEL2:2;
    uint32_t FLTEN2:1;
    uint32_t FSEL3:5;
    uint32_t MSEL3:2;
    uint32_t FLTEN3:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FLTCON0bits_t;
extern volatile __C1FLTCON0bits_t C1FLTCON0bits __asm__ ("C1FLTCON0") __attribute__((section("sfrs"), address(0xBF8800C0)));
extern volatile uint32_t        C1FLTCON0CLR __attribute__((section("sfrs"),address(0xBF8800C4)));
extern volatile uint32_t        C1FLTCON0SET __attribute__((section("sfrs"),address(0xBF8800C8)));
extern volatile uint32_t        C1FLTCON0INV __attribute__((section("sfrs"),address(0xBF8800CC)));
#define C1FLTCON1 C1FLTCON1
extern volatile uint32_t   C1FLTCON1 __attribute__((section("sfrs"), address(0xBF8800D0)));
typedef union {
  struct {
    uint32_t FSEL4:5;
    uint32_t MSEL4:2;
    uint32_t FLTEN4:1;
    uint32_t FSEL5:5;
    uint32_t MSEL5:2;
    uint32_t FLTEN5:1;
    uint32_t FSEL6:5;
    uint32_t MSEL6:2;
    uint32_t FLTEN6:1;
    uint32_t FSEL7:5;
    uint32_t MSEL7:2;
    uint32_t FLTEN7:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FLTCON1bits_t;
extern volatile __C1FLTCON1bits_t C1FLTCON1bits __asm__ ("C1FLTCON1") __attribute__((section("sfrs"), address(0xBF8800D0)));
extern volatile uint32_t        C1FLTCON1CLR __attribute__((section("sfrs"),address(0xBF8800D4)));
extern volatile uint32_t        C1FLTCON1SET __attribute__((section("sfrs"),address(0xBF8800D8)));
extern volatile uint32_t        C1FLTCON1INV __attribute__((section("sfrs"),address(0xBF8800DC)));
#define C1FLTCON2 C1FLTCON2
extern volatile uint32_t   C1FLTCON2 __attribute__((section("sfrs"), address(0xBF8800E0)));
typedef union {
  struct {
    uint32_t FSEL8:5;
    uint32_t MSEL8:2;
    uint32_t FLTEN8:1;
    uint32_t FSEL9:5;
    uint32_t MSEL9:2;
    uint32_t FLTEN9:1;
    uint32_t FSEL10:5;
    uint32_t MSEL10:2;
    uint32_t FLTEN10:1;
    uint32_t FSEL11:5;
    uint32_t MSEL11:2;
    uint32_t FLTEN11:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FLTCON2bits_t;
extern volatile __C1FLTCON2bits_t C1FLTCON2bits __asm__ ("C1FLTCON2") __attribute__((section("sfrs"), address(0xBF8800E0)));
extern volatile uint32_t        C1FLTCON2CLR __attribute__((section("sfrs"),address(0xBF8800E4)));
extern volatile uint32_t        C1FLTCON2SET __attribute__((section("sfrs"),address(0xBF8800E8)));
extern volatile uint32_t        C1FLTCON2INV __attribute__((section("sfrs"),address(0xBF8800EC)));
#define C1FLTCON3 C1FLTCON3
extern volatile uint32_t   C1FLTCON3 __attribute__((section("sfrs"), address(0xBF8800F0)));
typedef union {
  struct {
    uint32_t FSEL12:5;
    uint32_t MSEL12:2;
    uint32_t FLTEN12:1;
    uint32_t FSEL13:5;
    uint32_t MSEL13:2;
    uint32_t FLTEN13:1;
    uint32_t FSEL14:5;
    uint32_t MSEL14:2;
    uint32_t FLTEN14:1;
    uint32_t FSEL15:5;
    uint32_t MSEL15:2;
    uint32_t FLTEN15:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FLTCON3bits_t;
extern volatile __C1FLTCON3bits_t C1FLTCON3bits __asm__ ("C1FLTCON3") __attribute__((section("sfrs"), address(0xBF8800F0)));
extern volatile uint32_t        C1FLTCON3CLR __attribute__((section("sfrs"),address(0xBF8800F4)));
extern volatile uint32_t        C1FLTCON3SET __attribute__((section("sfrs"),address(0xBF8800F8)));
extern volatile uint32_t        C1FLTCON3INV __attribute__((section("sfrs"),address(0xBF8800FC)));
#define C1RXF0 C1RXF0
extern volatile uint32_t   C1RXF0 __attribute__((section("sfrs"), address(0xBF880140)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF0bits_t;
extern volatile __C1RXF0bits_t C1RXF0bits __asm__ ("C1RXF0") __attribute__((section("sfrs"), address(0xBF880140)));
extern volatile uint32_t        C1RXF0CLR __attribute__((section("sfrs"),address(0xBF880144)));
extern volatile uint32_t        C1RXF0SET __attribute__((section("sfrs"),address(0xBF880148)));
extern volatile uint32_t        C1RXF0INV __attribute__((section("sfrs"),address(0xBF88014C)));
#define C1RXF1 C1RXF1
extern volatile uint32_t   C1RXF1 __attribute__((section("sfrs"), address(0xBF880150)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF1bits_t;
extern volatile __C1RXF1bits_t C1RXF1bits __asm__ ("C1RXF1") __attribute__((section("sfrs"), address(0xBF880150)));
extern volatile uint32_t        C1RXF1CLR __attribute__((section("sfrs"),address(0xBF880154)));
extern volatile uint32_t        C1RXF1SET __attribute__((section("sfrs"),address(0xBF880158)));
extern volatile uint32_t        C1RXF1INV __attribute__((section("sfrs"),address(0xBF88015C)));
#define C1RXF2 C1RXF2
extern volatile uint32_t   C1RXF2 __attribute__((section("sfrs"), address(0xBF880160)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF2bits_t;
extern volatile __C1RXF2bits_t C1RXF2bits __asm__ ("C1RXF2") __attribute__((section("sfrs"), address(0xBF880160)));
extern volatile uint32_t        C1RXF2CLR __attribute__((section("sfrs"),address(0xBF880164)));
extern volatile uint32_t        C1RXF2SET __attribute__((section("sfrs"),address(0xBF880168)));
extern volatile uint32_t        C1RXF2INV __attribute__((section("sfrs"),address(0xBF88016C)));
#define C1RXF3 C1RXF3
extern volatile uint32_t   C1RXF3 __attribute__((section("sfrs"), address(0xBF880170)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF3bits_t;
extern volatile __C1RXF3bits_t C1RXF3bits __asm__ ("C1RXF3") __attribute__((section("sfrs"), address(0xBF880170)));
extern volatile uint32_t        C1RXF3CLR __attribute__((section("sfrs"),address(0xBF880174)));
extern volatile uint32_t        C1RXF3SET __attribute__((section("sfrs"),address(0xBF880178)));
extern volatile uint32_t        C1RXF3INV __attribute__((section("sfrs"),address(0xBF88017C)));
#define C1RXF4 C1RXF4
extern volatile uint32_t   C1RXF4 __attribute__((section("sfrs"), address(0xBF880180)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF4bits_t;
extern volatile __C1RXF4bits_t C1RXF4bits __asm__ ("C1RXF4") __attribute__((section("sfrs"), address(0xBF880180)));
extern volatile uint32_t        C1RXF4CLR __attribute__((section("sfrs"),address(0xBF880184)));
extern volatile uint32_t        C1RXF4SET __attribute__((section("sfrs"),address(0xBF880188)));
extern volatile uint32_t        C1RXF4INV __attribute__((section("sfrs"),address(0xBF88018C)));
#define C1RXF5 C1RXF5
extern volatile uint32_t   C1RXF5 __attribute__((section("sfrs"), address(0xBF880190)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF5bits_t;
extern volatile __C1RXF5bits_t C1RXF5bits __asm__ ("C1RXF5") __attribute__((section("sfrs"), address(0xBF880190)));
extern volatile uint32_t        C1RXF5CLR __attribute__((section("sfrs"),address(0xBF880194)));
extern volatile uint32_t        C1RXF5SET __attribute__((section("sfrs"),address(0xBF880198)));
extern volatile uint32_t        C1RXF5INV __attribute__((section("sfrs"),address(0xBF88019C)));
#define C1RXF6 C1RXF6
extern volatile uint32_t   C1RXF6 __attribute__((section("sfrs"), address(0xBF8801A0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF6bits_t;
extern volatile __C1RXF6bits_t C1RXF6bits __asm__ ("C1RXF6") __attribute__((section("sfrs"), address(0xBF8801A0)));
extern volatile uint32_t        C1RXF6CLR __attribute__((section("sfrs"),address(0xBF8801A4)));
extern volatile uint32_t        C1RXF6SET __attribute__((section("sfrs"),address(0xBF8801A8)));
extern volatile uint32_t        C1RXF6INV __attribute__((section("sfrs"),address(0xBF8801AC)));
#define C1RXF7 C1RXF7
extern volatile uint32_t   C1RXF7 __attribute__((section("sfrs"), address(0xBF8801B0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF7bits_t;
extern volatile __C1RXF7bits_t C1RXF7bits __asm__ ("C1RXF7") __attribute__((section("sfrs"), address(0xBF8801B0)));
extern volatile uint32_t        C1RXF7CLR __attribute__((section("sfrs"),address(0xBF8801B4)));
extern volatile uint32_t        C1RXF7SET __attribute__((section("sfrs"),address(0xBF8801B8)));
extern volatile uint32_t        C1RXF7INV __attribute__((section("sfrs"),address(0xBF8801BC)));
#define C1RXF8 C1RXF8
extern volatile uint32_t   C1RXF8 __attribute__((section("sfrs"), address(0xBF8801C0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF8bits_t;
extern volatile __C1RXF8bits_t C1RXF8bits __asm__ ("C1RXF8") __attribute__((section("sfrs"), address(0xBF8801C0)));
extern volatile uint32_t        C1RXF8CLR __attribute__((section("sfrs"),address(0xBF8801C4)));
extern volatile uint32_t        C1RXF8SET __attribute__((section("sfrs"),address(0xBF8801C8)));
extern volatile uint32_t        C1RXF8INV __attribute__((section("sfrs"),address(0xBF8801CC)));
#define C1RXF9 C1RXF9
extern volatile uint32_t   C1RXF9 __attribute__((section("sfrs"), address(0xBF8801D0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF9bits_t;
