Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0512mcf064.h
extern volatile __C3RXF15bits_t C3RXF15bits __asm__ ("C3RXF15") __attribute__((section("sfrs"), address(0xBF884230)));
extern volatile uint32_t        C3RXF15CLR __attribute__((section("sfrs"),address(0xBF884234)));
extern volatile uint32_t        C3RXF15SET __attribute__((section("sfrs"),address(0xBF884238)));
extern volatile uint32_t        C3RXF15INV __attribute__((section("sfrs"),address(0xBF88423C)));
#define C3FIFOBA C3FIFOBA
extern volatile uint32_t   C3FIFOBA __attribute__((section("sfrs"), address(0xBF884340)));
extern volatile uint32_t        C3FIFOBACLR __attribute__((section("sfrs"),address(0xBF884344)));
extern volatile uint32_t        C3FIFOBASET __attribute__((section("sfrs"),address(0xBF884348)));
extern volatile uint32_t        C3FIFOBAINV __attribute__((section("sfrs"),address(0xBF88434C)));
#define C3FIFOCON0 C3FIFOCON0
extern volatile uint32_t   C3FIFOCON0 __attribute__((section("sfrs"), address(0xBF884350)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCON0bits_t;
extern volatile __C3FIFOCON0bits_t C3FIFOCON0bits __asm__ ("C3FIFOCON0") __attribute__((section("sfrs"), address(0xBF884350)));
extern volatile uint32_t        C3FIFOCON0CLR __attribute__((section("sfrs"),address(0xBF884354)));
extern volatile uint32_t        C3FIFOCON0SET __attribute__((section("sfrs"),address(0xBF884358)));
extern volatile uint32_t        C3FIFOCON0INV __attribute__((section("sfrs"),address(0xBF88435C)));
#define C3FIFOINT0 C3FIFOINT0
extern volatile uint32_t   C3FIFOINT0 __attribute__((section("sfrs"), address(0xBF884360)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOINT0bits_t;
extern volatile __C3FIFOINT0bits_t C3FIFOINT0bits __asm__ ("C3FIFOINT0") __attribute__((section("sfrs"), address(0xBF884360)));
extern volatile uint32_t        C3FIFOINT0CLR __attribute__((section("sfrs"),address(0xBF884364)));
extern volatile uint32_t        C3FIFOINT0SET __attribute__((section("sfrs"),address(0xBF884368)));
extern volatile uint32_t        C3FIFOINT0INV __attribute__((section("sfrs"),address(0xBF88436C)));
#define C3FIFOUA0 C3FIFOUA0
extern volatile uint32_t   C3FIFOUA0 __attribute__((section("sfrs"), address(0xBF884370)));
extern volatile uint32_t        C3FIFOUA0CLR __attribute__((section("sfrs"),address(0xBF884374)));
extern volatile uint32_t        C3FIFOUA0SET __attribute__((section("sfrs"),address(0xBF884378)));
extern volatile uint32_t        C3FIFOUA0INV __attribute__((section("sfrs"),address(0xBF88437C)));
#define C3FIFOCI0 C3FIFOCI0
extern volatile uint32_t   C3FIFOCI0 __attribute__((section("sfrs"), address(0xBF884380)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCI0bits_t;
extern volatile __C3FIFOCI0bits_t C3FIFOCI0bits __asm__ ("C3FIFOCI0") __attribute__((section("sfrs"), address(0xBF884380)));
extern volatile uint32_t        C3FIFOCI0CLR __attribute__((section("sfrs"),address(0xBF884384)));
extern volatile uint32_t        C3FIFOCI0SET __attribute__((section("sfrs"),address(0xBF884388)));
extern volatile uint32_t        C3FIFOCI0INV __attribute__((section("sfrs"),address(0xBF88438C)));
#define C3FIFOCON1 C3FIFOCON1
extern volatile uint32_t   C3FIFOCON1 __attribute__((section("sfrs"), address(0xBF884390)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCON1bits_t;
extern volatile __C3FIFOCON1bits_t C3FIFOCON1bits __asm__ ("C3FIFOCON1") __attribute__((section("sfrs"), address(0xBF884390)));
extern volatile uint32_t        C3FIFOCON1CLR __attribute__((section("sfrs"),address(0xBF884394)));
extern volatile uint32_t        C3FIFOCON1SET __attribute__((section("sfrs"),address(0xBF884398)));
extern volatile uint32_t        C3FIFOCON1INV __attribute__((section("sfrs"),address(0xBF88439C)));
#define C3FIFOINT1 C3FIFOINT1
extern volatile uint32_t   C3FIFOINT1 __attribute__((section("sfrs"), address(0xBF8843A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOINT1bits_t;
extern volatile __C3FIFOINT1bits_t C3FIFOINT1bits __asm__ ("C3FIFOINT1") __attribute__((section("sfrs"), address(0xBF8843A0)));
extern volatile uint32_t        C3FIFOINT1CLR __attribute__((section("sfrs"),address(0xBF8843A4)));
extern volatile uint32_t        C3FIFOINT1SET __attribute__((section("sfrs"),address(0xBF8843A8)));
extern volatile uint32_t        C3FIFOINT1INV __attribute__((section("sfrs"),address(0xBF8843AC)));
#define C3FIFOUA1 C3FIFOUA1
extern volatile uint32_t   C3FIFOUA1 __attribute__((section("sfrs"), address(0xBF8843B0)));
extern volatile uint32_t        C3FIFOUA1CLR __attribute__((section("sfrs"),address(0xBF8843B4)));
extern volatile uint32_t        C3FIFOUA1SET __attribute__((section("sfrs"),address(0xBF8843B8)));
extern volatile uint32_t        C3FIFOUA1INV __attribute__((section("sfrs"),address(0xBF8843BC)));
#define C3FIFOCI1 C3FIFOCI1
extern volatile uint32_t   C3FIFOCI1 __attribute__((section("sfrs"), address(0xBF8843C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCI1bits_t;
extern volatile __C3FIFOCI1bits_t C3FIFOCI1bits __asm__ ("C3FIFOCI1") __attribute__((section("sfrs"), address(0xBF8843C0)));
extern volatile uint32_t        C3FIFOCI1CLR __attribute__((section("sfrs"),address(0xBF8843C4)));
extern volatile uint32_t        C3FIFOCI1SET __attribute__((section("sfrs"),address(0xBF8843C8)));
extern volatile uint32_t        C3FIFOCI1INV __attribute__((section("sfrs"),address(0xBF8843CC)));
#define C3FIFOCON2 C3FIFOCON2
extern volatile uint32_t   C3FIFOCON2 __attribute__((section("sfrs"), address(0xBF8843D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCON2bits_t;
extern volatile __C3FIFOCON2bits_t C3FIFOCON2bits __asm__ ("C3FIFOCON2") __attribute__((section("sfrs"), address(0xBF8843D0)));
extern volatile uint32_t        C3FIFOCON2CLR __attribute__((section("sfrs"),address(0xBF8843D4)));
extern volatile uint32_t        C3FIFOCON2SET __attribute__((section("sfrs"),address(0xBF8843D8)));
extern volatile uint32_t        C3FIFOCON2INV __attribute__((section("sfrs"),address(0xBF8843DC)));
#define C3FIFOINT2 C3FIFOINT2
extern volatile uint32_t   C3FIFOINT2 __attribute__((section("sfrs"), address(0xBF8843E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOINT2bits_t;
extern volatile __C3FIFOINT2bits_t C3FIFOINT2bits __asm__ ("C3FIFOINT2") __attribute__((section("sfrs"), address(0xBF8843E0)));
extern volatile uint32_t        C3FIFOINT2CLR __attribute__((section("sfrs"),address(0xBF8843E4)));
extern volatile uint32_t        C3FIFOINT2SET __attribute__((section("sfrs"),address(0xBF8843E8)));
extern volatile uint32_t        C3FIFOINT2INV __attribute__((section("sfrs"),address(0xBF8843EC)));
#define C3FIFOUA2 C3FIFOUA2
extern volatile uint32_t   C3FIFOUA2 __attribute__((section("sfrs"), address(0xBF8843F0)));
extern volatile uint32_t        C3FIFOUA2CLR __attribute__((section("sfrs"),address(0xBF8843F4)));
extern volatile uint32_t        C3FIFOUA2SET __attribute__((section("sfrs"),address(0xBF8843F8)));
extern volatile uint32_t        C3FIFOUA2INV __attribute__((section("sfrs"),address(0xBF8843FC)));
#define C3FIFOCI2 C3FIFOCI2
extern volatile uint32_t   C3FIFOCI2 __attribute__((section("sfrs"), address(0xBF884400)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCI2bits_t;
