Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0512mcf064.h
extern volatile __C3FIFOINT11bits_t C3FIFOINT11bits __asm__ ("C3FIFOINT11") __attribute__((section("sfrs"), address(0xBF884620)));
extern volatile uint32_t        C3FIFOINT11CLR __attribute__((section("sfrs"),address(0xBF884624)));
extern volatile uint32_t        C3FIFOINT11SET __attribute__((section("sfrs"),address(0xBF884628)));
extern volatile uint32_t        C3FIFOINT11INV __attribute__((section("sfrs"),address(0xBF88462C)));
#define C3FIFOUA11 C3FIFOUA11
extern volatile uint32_t   C3FIFOUA11 __attribute__((section("sfrs"), address(0xBF884630)));
extern volatile uint32_t        C3FIFOUA11CLR __attribute__((section("sfrs"),address(0xBF884634)));
extern volatile uint32_t        C3FIFOUA11SET __attribute__((section("sfrs"),address(0xBF884638)));
extern volatile uint32_t        C3FIFOUA11INV __attribute__((section("sfrs"),address(0xBF88463C)));
#define C3FIFOCI11 C3FIFOCI11
extern volatile uint32_t   C3FIFOCI11 __attribute__((section("sfrs"), address(0xBF884640)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCI11bits_t;
extern volatile __C3FIFOCI11bits_t C3FIFOCI11bits __asm__ ("C3FIFOCI11") __attribute__((section("sfrs"), address(0xBF884640)));
extern volatile uint32_t        C3FIFOCI11CLR __attribute__((section("sfrs"),address(0xBF884644)));
extern volatile uint32_t        C3FIFOCI11SET __attribute__((section("sfrs"),address(0xBF884648)));
extern volatile uint32_t        C3FIFOCI11INV __attribute__((section("sfrs"),address(0xBF88464C)));
#define C3FIFOCON12 C3FIFOCON12
extern volatile uint32_t   C3FIFOCON12 __attribute__((section("sfrs"), address(0xBF884650)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCON12bits_t;
extern volatile __C3FIFOCON12bits_t C3FIFOCON12bits __asm__ ("C3FIFOCON12") __attribute__((section("sfrs"), address(0xBF884650)));
extern volatile uint32_t        C3FIFOCON12CLR __attribute__((section("sfrs"),address(0xBF884654)));
extern volatile uint32_t        C3FIFOCON12SET __attribute__((section("sfrs"),address(0xBF884658)));
extern volatile uint32_t        C3FIFOCON12INV __attribute__((section("sfrs"),address(0xBF88465C)));
#define C3FIFOINT12 C3FIFOINT12
extern volatile uint32_t   C3FIFOINT12 __attribute__((section("sfrs"), address(0xBF884660)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOINT12bits_t;
extern volatile __C3FIFOINT12bits_t C3FIFOINT12bits __asm__ ("C3FIFOINT12") __attribute__((section("sfrs"), address(0xBF884660)));
extern volatile uint32_t        C3FIFOINT12CLR __attribute__((section("sfrs"),address(0xBF884664)));
extern volatile uint32_t        C3FIFOINT12SET __attribute__((section("sfrs"),address(0xBF884668)));
extern volatile uint32_t        C3FIFOINT12INV __attribute__((section("sfrs"),address(0xBF88466C)));
#define C3FIFOUA12 C3FIFOUA12
extern volatile uint32_t   C3FIFOUA12 __attribute__((section("sfrs"), address(0xBF884670)));
extern volatile uint32_t        C3FIFOUA12CLR __attribute__((section("sfrs"),address(0xBF884674)));
extern volatile uint32_t        C3FIFOUA12SET __attribute__((section("sfrs"),address(0xBF884678)));
extern volatile uint32_t        C3FIFOUA12INV __attribute__((section("sfrs"),address(0xBF88467C)));
#define C3FIFOCI12 C3FIFOCI12
extern volatile uint32_t   C3FIFOCI12 __attribute__((section("sfrs"), address(0xBF884680)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCI12bits_t;
extern volatile __C3FIFOCI12bits_t C3FIFOCI12bits __asm__ ("C3FIFOCI12") __attribute__((section("sfrs"), address(0xBF884680)));
extern volatile uint32_t        C3FIFOCI12CLR __attribute__((section("sfrs"),address(0xBF884684)));
extern volatile uint32_t        C3FIFOCI12SET __attribute__((section("sfrs"),address(0xBF884688)));
extern volatile uint32_t        C3FIFOCI12INV __attribute__((section("sfrs"),address(0xBF88468C)));
#define C3FIFOCON13 C3FIFOCON13
extern volatile uint32_t   C3FIFOCON13 __attribute__((section("sfrs"), address(0xBF884690)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCON13bits_t;
extern volatile __C3FIFOCON13bits_t C3FIFOCON13bits __asm__ ("C3FIFOCON13") __attribute__((section("sfrs"), address(0xBF884690)));
extern volatile uint32_t        C3FIFOCON13CLR __attribute__((section("sfrs"),address(0xBF884694)));
extern volatile uint32_t        C3FIFOCON13SET __attribute__((section("sfrs"),address(0xBF884698)));
extern volatile uint32_t        C3FIFOCON13INV __attribute__((section("sfrs"),address(0xBF88469C)));
#define C3FIFOINT13 C3FIFOINT13
extern volatile uint32_t   C3FIFOINT13 __attribute__((section("sfrs"), address(0xBF8846A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOINT13bits_t;
