Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0512mcf064.h
extern volatile __C3FIFOINT13bits_t C3FIFOINT13bits __asm__ ("C3FIFOINT13") __attribute__((section("sfrs"), address(0xBF8846A0)));
extern volatile uint32_t        C3FIFOINT13CLR __attribute__((section("sfrs"),address(0xBF8846A4)));
extern volatile uint32_t        C3FIFOINT13SET __attribute__((section("sfrs"),address(0xBF8846A8)));
extern volatile uint32_t        C3FIFOINT13INV __attribute__((section("sfrs"),address(0xBF8846AC)));
#define C3FIFOUA13 C3FIFOUA13
extern volatile uint32_t   C3FIFOUA13 __attribute__((section("sfrs"), address(0xBF8846B0)));
extern volatile uint32_t        C3FIFOUA13CLR __attribute__((section("sfrs"),address(0xBF8846B4)));
extern volatile uint32_t        C3FIFOUA13SET __attribute__((section("sfrs"),address(0xBF8846B8)));
extern volatile uint32_t        C3FIFOUA13INV __attribute__((section("sfrs"),address(0xBF8846BC)));
#define C3FIFOCI13 C3FIFOCI13
extern volatile uint32_t   C3FIFOCI13 __attribute__((section("sfrs"), address(0xBF8846C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCI13bits_t;
extern volatile __C3FIFOCI13bits_t C3FIFOCI13bits __asm__ ("C3FIFOCI13") __attribute__((section("sfrs"), address(0xBF8846C0)));
extern volatile uint32_t        C3FIFOCI13CLR __attribute__((section("sfrs"),address(0xBF8846C4)));
extern volatile uint32_t        C3FIFOCI13SET __attribute__((section("sfrs"),address(0xBF8846C8)));
extern volatile uint32_t        C3FIFOCI13INV __attribute__((section("sfrs"),address(0xBF8846CC)));
#define C3FIFOCON14 C3FIFOCON14
extern volatile uint32_t   C3FIFOCON14 __attribute__((section("sfrs"), address(0xBF8846D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCON14bits_t;
extern volatile __C3FIFOCON14bits_t C3FIFOCON14bits __asm__ ("C3FIFOCON14") __attribute__((section("sfrs"), address(0xBF8846D0)));
extern volatile uint32_t        C3FIFOCON14CLR __attribute__((section("sfrs"),address(0xBF8846D4)));
extern volatile uint32_t        C3FIFOCON14SET __attribute__((section("sfrs"),address(0xBF8846D8)));
extern volatile uint32_t        C3FIFOCON14INV __attribute__((section("sfrs"),address(0xBF8846DC)));
#define C3FIFOINT14 C3FIFOINT14
extern volatile uint32_t   C3FIFOINT14 __attribute__((section("sfrs"), address(0xBF8846E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOINT14bits_t;
extern volatile __C3FIFOINT14bits_t C3FIFOINT14bits __asm__ ("C3FIFOINT14") __attribute__((section("sfrs"), address(0xBF8846E0)));
extern volatile uint32_t        C3FIFOINT14CLR __attribute__((section("sfrs"),address(0xBF8846E4)));
extern volatile uint32_t        C3FIFOINT14SET __attribute__((section("sfrs"),address(0xBF8846E8)));
extern volatile uint32_t        C3FIFOINT14INV __attribute__((section("sfrs"),address(0xBF8846EC)));
#define C3FIFOUA14 C3FIFOUA14
extern volatile uint32_t   C3FIFOUA14 __attribute__((section("sfrs"), address(0xBF8846F0)));
extern volatile uint32_t        C3FIFOUA14CLR __attribute__((section("sfrs"),address(0xBF8846F4)));
extern volatile uint32_t        C3FIFOUA14SET __attribute__((section("sfrs"),address(0xBF8846F8)));
extern volatile uint32_t        C3FIFOUA14INV __attribute__((section("sfrs"),address(0xBF8846FC)));
#define C3FIFOCI14 C3FIFOCI14
extern volatile uint32_t   C3FIFOCI14 __attribute__((section("sfrs"), address(0xBF884700)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCI14bits_t;
extern volatile __C3FIFOCI14bits_t C3FIFOCI14bits __asm__ ("C3FIFOCI14") __attribute__((section("sfrs"), address(0xBF884700)));
extern volatile uint32_t        C3FIFOCI14CLR __attribute__((section("sfrs"),address(0xBF884704)));
extern volatile uint32_t        C3FIFOCI14SET __attribute__((section("sfrs"),address(0xBF884708)));
extern volatile uint32_t        C3FIFOCI14INV __attribute__((section("sfrs"),address(0xBF88470C)));
#define C3FIFOCON15 C3FIFOCON15
extern volatile uint32_t   C3FIFOCON15 __attribute__((section("sfrs"), address(0xBF884710)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCON15bits_t;
extern volatile __C3FIFOCON15bits_t C3FIFOCON15bits __asm__ ("C3FIFOCON15") __attribute__((section("sfrs"), address(0xBF884710)));
extern volatile uint32_t        C3FIFOCON15CLR __attribute__((section("sfrs"),address(0xBF884714)));
extern volatile uint32_t        C3FIFOCON15SET __attribute__((section("sfrs"),address(0xBF884718)));
extern volatile uint32_t        C3FIFOCON15INV __attribute__((section("sfrs"),address(0xBF88471C)));
#define C3FIFOINT15 C3FIFOINT15
extern volatile uint32_t   C3FIFOINT15 __attribute__((section("sfrs"), address(0xBF884720)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOINT15bits_t;
extern volatile __C3FIFOINT15bits_t C3FIFOINT15bits __asm__ ("C3FIFOINT15") __attribute__((section("sfrs"), address(0xBF884720)));
extern volatile uint32_t        C3FIFOINT15CLR __attribute__((section("sfrs"),address(0xBF884724)));
extern volatile uint32_t        C3FIFOINT15SET __attribute__((section("sfrs"),address(0xBF884728)));
extern volatile uint32_t        C3FIFOINT15INV __attribute__((section("sfrs"),address(0xBF88472C)));
#define C3FIFOUA15 C3FIFOUA15
extern volatile uint32_t   C3FIFOUA15 __attribute__((section("sfrs"), address(0xBF884730)));
extern volatile uint32_t        C3FIFOUA15CLR __attribute__((section("sfrs"),address(0xBF884734)));
extern volatile uint32_t        C3FIFOUA15SET __attribute__((section("sfrs"),address(0xBF884738)));
extern volatile uint32_t        C3FIFOUA15INV __attribute__((section("sfrs"),address(0xBF88473C)));
#define C3FIFOCI15 C3FIFOCI15
extern volatile uint32_t   C3FIFOCI15 __attribute__((section("sfrs"), address(0xBF884740)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCI15bits_t;
extern volatile __C3FIFOCI15bits_t C3FIFOCI15bits __asm__ ("C3FIFOCI15") __attribute__((section("sfrs"), address(0xBF884740)));
extern volatile uint32_t        C3FIFOCI15CLR __attribute__((section("sfrs"),address(0xBF884744)));
extern volatile uint32_t        C3FIFOCI15SET __attribute__((section("sfrs"),address(0xBF884748)));
extern volatile uint32_t        C3FIFOCI15INV __attribute__((section("sfrs"),address(0xBF88474C)));
#define C4CON C4CON
extern volatile uint32_t   C4CON __attribute__((section("sfrs"), address(0xBF885000)));
typedef union {
  struct {
    uint32_t DNCNT:5;
    uint32_t :6;
    uint32_t CANBUSY:1;
    uint32_t :1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t :4;
    uint32_t CANCAP:1;
    uint32_t OPMOD:3;
    uint32_t REQOP:3;
    uint32_t ABAT:1;
  };
  struct {
    uint32_t w:32;
  };
} __C4CONbits_t;
