Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0512mcf064.h
  .extern STRIG5SET        /* 0xBF82A568 */
  .extern STRIG5INV        /* 0xBF82A56C */
  .extern CAP5             /* 0xBF82A570 */
  .extern CAP5CLR          /* 0xBF82A574 */
  .extern CAP5SET          /* 0xBF82A578 */
  .extern CAP5INV          /* 0xBF82A57C */
  .extern LEBCON5          /* 0xBF82A580 */
  .extern LEBCON5CLR       /* 0xBF82A584 */
  .extern LEBCON5SET       /* 0xBF82A588 */
  .extern LEBCON5INV       /* 0xBF82A58C */
  .extern LEBDLY5          /* 0xBF82A590 */
  .extern LEBDLY5CLR       /* 0xBF82A594 */
  .extern LEBDLY5SET       /* 0xBF82A598 */
  .extern LEBDLY5INV       /* 0xBF82A59C */
  .extern AUXCON5          /* 0xBF82A5A0 */
  .extern AUXCON5CLR       /* 0xBF82A5A4 */
  .extern AUXCON5SET       /* 0xBF82A5A8 */
  .extern AUXCON5INV       /* 0xBF82A5AC */
  .extern PTMR5            /* 0xBF82A5B0 */
  .extern PTMR5CLR         /* 0xBF82A5B4 */
  .extern PTMR5SET         /* 0xBF82A5B8 */
  .extern PTMR5INV         /* 0xBF82A5BC */
  .extern PWMCON6          /* 0xBF82A5C0 */
  .extern PWMCON6CLR       /* 0xBF82A5C4 */
  .extern PWMCON6SET       /* 0xBF82A5C8 */
  .extern PWMCON6INV       /* 0xBF82A5CC */
  .extern IOCON6           /* 0xBF82A5D0 */
  .extern IOCON6CLR        /* 0xBF82A5D4 */
  .extern IOCON6SET        /* 0xBF82A5D8 */
  .extern IOCON6INV        /* 0xBF82A5DC */
  .extern PDC6             /* 0xBF82A5E0 */
  .extern PDC6CLR          /* 0xBF82A5E4 */
  .extern PDC6SET          /* 0xBF82A5E8 */
  .extern PDC6INV          /* 0xBF82A5EC */
  .extern SDC6             /* 0xBF82A5F0 */
  .extern SDC6CLR          /* 0xBF82A5F4 */
  .extern SDC6SET          /* 0xBF82A5F8 */
  .extern SDC6INV          /* 0xBF82A5FC */
  .extern PHASE6           /* 0xBF82A600 */
  .extern PHASE6CLR        /* 0xBF82A604 */
  .extern PHASE6SET        /* 0xBF82A608 */
  .extern PHASE6INV        /* 0xBF82A60C */
  .extern DTR6             /* 0xBF82A610 */
  .extern DTR6CLR          /* 0xBF82A614 */
  .extern DTR6SET          /* 0xBF82A618 */
  .extern DTR6INV          /* 0xBF82A61C */
  .extern ALTDTR6          /* 0xBF82A620 */
  .extern ALTDTR6CLR       /* 0xBF82A624 */
  .extern ALTDTR6SET       /* 0xBF82A628 */
  .extern ALTDTR6INV       /* 0xBF82A62C */
  .extern DTCOMP6          /* 0xBF82A630 */
  .extern DTCOMP6CLR       /* 0xBF82A634 */
  .extern DTCOMP6SET       /* 0xBF82A638 */
  .extern DTCOMP6INV       /* 0xBF82A63C */
  .extern TRIG6            /* 0xBF82A640 */
  .extern TRIG6CLR         /* 0xBF82A644 */
  .extern TRIG6SET         /* 0xBF82A648 */
  .extern TRIG6INV         /* 0xBF82A64C */
  .extern TRGCON6          /* 0xBF82A650 */
  .extern TRGCON6CLR       /* 0xBF82A654 */
  .extern TRGCON6SET       /* 0xBF82A658 */
  .extern TRGCON6INV       /* 0xBF82A65C */
  .extern STRIG6           /* 0xBF82A660 */
  .extern STRIG6CLR        /* 0xBF82A664 */
  .extern STRIG6SET        /* 0xBF82A668 */
  .extern STRIG6INV        /* 0xBF82A66C */
  .extern CAP6             /* 0xBF82A670 */
  .extern CAP6CLR          /* 0xBF82A674 */
  .extern CAP6SET          /* 0xBF82A678 */
  .extern CAP6INV          /* 0xBF82A67C */
  .extern LEBCON6          /* 0xBF82A680 */
  .extern LEBCON6CLR       /* 0xBF82A684 */
  .extern LEBCON6SET       /* 0xBF82A688 */
  .extern LEBCON6INV       /* 0xBF82A68C */
  .extern LEBDLY6          /* 0xBF82A690 */
  .extern LEBDLY6CLR       /* 0xBF82A694 */
  .extern LEBDLY6SET       /* 0xBF82A698 */
  .extern LEBDLY6INV       /* 0xBF82A69C */
  .extern AUXCON6          /* 0xBF82A6A0 */
  .extern AUXCON6CLR       /* 0xBF82A6A4 */
  .extern AUXCON6SET       /* 0xBF82A6A8 */
  .extern AUXCON6INV       /* 0xBF82A6AC */
  .extern PTMR6            /* 0xBF82A6B0 */
  .extern PTMR6CLR         /* 0xBF82A6B4 */
  .extern PTMR6SET         /* 0xBF82A6B8 */
  .extern PTMR6INV         /* 0xBF82A6BC */
  .extern PWMCON7          /* 0xBF82A6C0 */
  .extern PWMCON7CLR       /* 0xBF82A6C4 */
  .extern PWMCON7SET       /* 0xBF82A6C8 */
  .extern PWMCON7INV       /* 0xBF82A6CC */
  .extern IOCON7           /* 0xBF82A6D0 */
  .extern IOCON7CLR        /* 0xBF82A6D4 */
  .extern IOCON7SET        /* 0xBF82A6D8 */
  .extern IOCON7INV        /* 0xBF82A6DC */
  .extern PDC7             /* 0xBF82A6E0 */
  .extern PDC7CLR          /* 0xBF82A6E4 */
  .extern PDC7SET          /* 0xBF82A6E8 */
  .extern PDC7INV          /* 0xBF82A6EC */
  .extern SDC7             /* 0xBF82A6F0 */
  .extern SDC7CLR          /* 0xBF82A6F4 */
  .extern SDC7SET          /* 0xBF82A6F8 */
  .extern SDC7INV          /* 0xBF82A6FC */
  .extern PHASE7           /* 0xBF82A700 */
  .extern PHASE7CLR        /* 0xBF82A704 */
  .extern PHASE7SET        /* 0xBF82A708 */
  .extern PHASE7INV        /* 0xBF82A70C */
  .extern DTR7             /* 0xBF82A710 */
  .extern DTR7CLR          /* 0xBF82A714 */
  .extern DTR7SET          /* 0xBF82A718 */
  .extern DTR7INV          /* 0xBF82A71C */
  .extern ALTDTR7          /* 0xBF82A720 */
  .extern ALTDTR7CLR       /* 0xBF82A724 */
  .extern ALTDTR7SET       /* 0xBF82A728 */
  .extern ALTDTR7INV       /* 0xBF82A72C */
  .extern DTCOMP7          /* 0xBF82A730 */
  .extern DTCOMP7CLR       /* 0xBF82A734 */
  .extern DTCOMP7SET       /* 0xBF82A738 */
  .extern DTCOMP7INV       /* 0xBF82A73C */
  .extern TRIG7            /* 0xBF82A740 */
  .extern TRIG7CLR         /* 0xBF82A744 */
  .extern TRIG7SET         /* 0xBF82A748 */
  .extern TRIG7INV         /* 0xBF82A74C */
  .extern TRGCON7          /* 0xBF82A750 */
  .extern TRGCON7CLR       /* 0xBF82A754 */
  .extern TRGCON7SET       /* 0xBF82A758 */
  .extern TRGCON7INV       /* 0xBF82A75C */
  .extern STRIG7           /* 0xBF82A760 */
  .extern STRIG7CLR        /* 0xBF82A764 */
  .extern STRIG7SET        /* 0xBF82A768 */
  .extern STRIG7INV        /* 0xBF82A76C */
  .extern CAP7             /* 0xBF82A770 */
  .extern CAP7CLR          /* 0xBF82A774 */
  .extern CAP7SET          /* 0xBF82A778 */
  .extern CAP7INV          /* 0xBF82A77C */
  .extern LEBCON7          /* 0xBF82A780 */
  .extern LEBCON7CLR       /* 0xBF82A784 */
  .extern LEBCON7SET       /* 0xBF82A788 */
  .extern LEBCON7INV       /* 0xBF82A78C */
  .extern LEBDLY7          /* 0xBF82A790 */
  .extern LEBDLY7CLR       /* 0xBF82A794 */
  .extern LEBDLY7SET       /* 0xBF82A798 */
  .extern LEBDLY7INV       /* 0xBF82A79C */
  .extern AUXCON7          /* 0xBF82A7A0 */
  .extern AUXCON7CLR       /* 0xBF82A7A4 */
  .extern AUXCON7SET       /* 0xBF82A7A8 */
  .extern AUXCON7INV       /* 0xBF82A7AC */
  .extern PTMR7            /* 0xBF82A7B0 */
  .extern PTMR7CLR         /* 0xBF82A7B4 */
  .extern PTMR7SET         /* 0xBF82A7B8 */
  .extern PTMR7INV         /* 0xBF82A7BC */
  .extern PWMCON8          /* 0xBF82A7C0 */
  .extern PWMCON8CLR       /* 0xBF82A7C4 */
  .extern PWMCON8SET       /* 0xBF82A7C8 */
  .extern PWMCON8INV       /* 0xBF82A7CC */
  .extern IOCON8           /* 0xBF82A7D0 */
  .extern IOCON8CLR        /* 0xBF82A7D4 */
  .extern IOCON8SET        /* 0xBF82A7D8 */
  .extern IOCON8INV        /* 0xBF82A7DC */
  .extern PDC8             /* 0xBF82A7E0 */
  .extern PDC8CLR          /* 0xBF82A7E4 */
  .extern PDC8SET          /* 0xBF82A7E8 */
  .extern PDC8INV          /* 0xBF82A7EC */
  .extern SDC8             /* 0xBF82A7F0 */
  .extern SDC8CLR          /* 0xBF82A7F4 */
  .extern SDC8SET          /* 0xBF82A7F8 */
  .extern SDC8INV          /* 0xBF82A7FC */
  .extern PHASE8           /* 0xBF82A800 */
  .extern PHASE8CLR        /* 0xBF82A804 */
  .extern PHASE8SET        /* 0xBF82A808 */
  .extern PHASE8INV        /* 0xBF82A80C */
  .extern DTR8             /* 0xBF82A810 */
  .extern DTR8CLR          /* 0xBF82A814 */
  .extern DTR8SET          /* 0xBF82A818 */
  .extern DTR8INV          /* 0xBF82A81C */
  .extern ALTDTR8          /* 0xBF82A820 */
  .extern ALTDTR8CLR       /* 0xBF82A824 */
  .extern ALTDTR8SET       /* 0xBF82A828 */
  .extern ALTDTR8INV       /* 0xBF82A82C */
  .extern DTCOMP8          /* 0xBF82A830 */
  .extern DTCOMP8CLR       /* 0xBF82A834 */
  .extern DTCOMP8SET       /* 0xBF82A838 */
  .extern DTCOMP8INV       /* 0xBF82A83C */
  .extern TRIG8            /* 0xBF82A840 */
  .extern TRIG8CLR         /* 0xBF82A844 */
  .extern TRIG8SET         /* 0xBF82A848 */
  .extern TRIG8INV         /* 0xBF82A84C */
  .extern TRGCON8          /* 0xBF82A850 */
  .extern TRGCON8CLR       /* 0xBF82A854 */
  .extern TRGCON8SET       /* 0xBF82A858 */
  .extern TRGCON8INV       /* 0xBF82A85C */
  .extern STRIG8           /* 0xBF82A860 */
  .extern STRIG8CLR        /* 0xBF82A864 */
  .extern STRIG8SET        /* 0xBF82A868 */
  .extern STRIG8INV        /* 0xBF82A86C */
  .extern CAP8             /* 0xBF82A870 */
  .extern CAP8CLR          /* 0xBF82A874 */
  .extern CAP8SET          /* 0xBF82A878 */
  .extern CAP8INV          /* 0xBF82A87C */
  .extern LEBCON8          /* 0xBF82A880 */
  .extern LEBCON8CLR       /* 0xBF82A884 */
  .extern LEBCON8SET       /* 0xBF82A888 */
  .extern LEBCON8INV       /* 0xBF82A88C */
  .extern LEBDLY8          /* 0xBF82A890 */
  .extern LEBDLY8CLR       /* 0xBF82A894 */
  .extern LEBDLY8SET       /* 0xBF82A898 */
  .extern LEBDLY8INV       /* 0xBF82A89C */
  .extern AUXCON8          /* 0xBF82A8A0 */
  .extern AUXCON8CLR       /* 0xBF82A8A4 */
  .extern AUXCON8SET       /* 0xBF82A8A8 */
  .extern AUXCON8INV       /* 0xBF82A8AC */
  .extern PTMR8            /* 0xBF82A8B0 */
  .extern PTMR8CLR         /* 0xBF82A8B4 */
  .extern PTMR8SET         /* 0xBF82A8B8 */
  .extern PTMR8INV         /* 0xBF82A8BC */
  .extern PWMCON9          /* 0xBF82A8C0 */
  .extern PWMCON9CLR       /* 0xBF82A8C4 */
  .extern PWMCON9SET       /* 0xBF82A8C8 */
  .extern PWMCON9INV       /* 0xBF82A8CC */
  .extern IOCON9           /* 0xBF82A8D0 */
  .extern IOCON9CLR        /* 0xBF82A8D4 */
  .extern IOCON9SET        /* 0xBF82A8D8 */
  .extern IOCON9INV        /* 0xBF82A8DC */
  .extern PDC9             /* 0xBF82A8E0 */
  .extern PDC9CLR          /* 0xBF82A8E4 */
  .extern PDC9SET          /* 0xBF82A8E8 */
  .extern PDC9INV          /* 0xBF82A8EC */
  .extern SDC9             /* 0xBF82A8F0 */
  .extern SDC9CLR          /* 0xBF82A8F4 */
  .extern SDC9SET          /* 0xBF82A8F8 */
  .extern SDC9INV          /* 0xBF82A8FC */
  .extern PHASE9           /* 0xBF82A900 */
  .extern PHASE9CLR        /* 0xBF82A904 */
  .extern PHASE9SET        /* 0xBF82A908 */
  .extern PHASE9INV        /* 0xBF82A90C */
  .extern DTR9             /* 0xBF82A910 */
  .extern DTR9CLR          /* 0xBF82A914 */
  .extern DTR9SET          /* 0xBF82A918 */
  .extern DTR9INV          /* 0xBF82A91C */
  .extern ALTDTR9          /* 0xBF82A920 */
  .extern ALTDTR9CLR       /* 0xBF82A924 */
  .extern ALTDTR9SET       /* 0xBF82A928 */
  .extern ALTDTR9INV       /* 0xBF82A92C */
  .extern DTCOMP9          /* 0xBF82A930 */
  .extern DTCOMP9CLR       /* 0xBF82A934 */
  .extern DTCOMP9SET       /* 0xBF82A938 */
  .extern DTCOMP9INV       /* 0xBF82A93C */
  .extern TRIG9            /* 0xBF82A940 */
  .extern TRIG9CLR         /* 0xBF82A944 */
  .extern TRIG9SET         /* 0xBF82A948 */
  .extern TRIG9INV         /* 0xBF82A94C */
  .extern TRGCON9          /* 0xBF82A950 */
  .extern TRGCON9CLR       /* 0xBF82A954 */
  .extern TRGCON9SET       /* 0xBF82A958 */
  .extern TRGCON9INV       /* 0xBF82A95C */
  .extern STRIG9           /* 0xBF82A960 */
  .extern STRIG9CLR        /* 0xBF82A964 */
  .extern STRIG9SET        /* 0xBF82A968 */
  .extern STRIG9INV        /* 0xBF82A96C */
  .extern CAP9             /* 0xBF82A970 */
  .extern CAP9CLR          /* 0xBF82A974 */
  .extern CAP9SET          /* 0xBF82A978 */
  .extern CAP9INV          /* 0xBF82A97C */
  .extern LEBCON9          /* 0xBF82A980 */
  .extern LEBCON9CLR       /* 0xBF82A984 */
  .extern LEBCON9SET       /* 0xBF82A988 */
  .extern LEBCON9INV       /* 0xBF82A98C */
  .extern LEBDLY9          /* 0xBF82A990 */
  .extern LEBDLY9CLR       /* 0xBF82A994 */
  .extern LEBDLY9SET       /* 0xBF82A998 */
  .extern LEBDLY9INV       /* 0xBF82A99C */
  .extern AUXCON9          /* 0xBF82A9A0 */
  .extern AUXCON9CLR       /* 0xBF82A9A4 */
  .extern AUXCON9SET       /* 0xBF82A9A8 */
  .extern AUXCON9INV       /* 0xBF82A9AC */
  .extern PTMR9            /* 0xBF82A9B0 */
  .extern PTMR9CLR         /* 0xBF82A9B4 */
  .extern PTMR9SET         /* 0xBF82A9B8 */
  .extern PTMR9INV         /* 0xBF82A9BC */
  .extern PWMCON10         /* 0xBF82A9C0 */
  .extern PWMCON10CLR      /* 0xBF82A9C4 */
  .extern PWMCON10SET      /* 0xBF82A9C8 */
  .extern PWMCON10INV      /* 0xBF82A9CC */
  .extern IOCON10          /* 0xBF82A9D0 */
  .extern IOCON10CLR       /* 0xBF82A9D4 */
  .extern IOCON10SET       /* 0xBF82A9D8 */
  .extern IOCON10INV       /* 0xBF82A9DC */
  .extern PDC10            /* 0xBF82A9E0 */
  .extern PDC10CLR         /* 0xBF82A9E4 */
  .extern PDC10SET         /* 0xBF82A9E8 */
  .extern PDC10INV         /* 0xBF82A9EC */
  .extern SDC10            /* 0xBF82A9F0 */
  .extern SDC10CLR         /* 0xBF82A9F4 */
  .extern SDC10SET         /* 0xBF82A9F8 */
  .extern SDC10INV         /* 0xBF82A9FC */
  .extern PHASE10          /* 0xBF82AA00 */
  .extern PHASE10CLR       /* 0xBF82AA04 */
  .extern PHASE10SET       /* 0xBF82AA08 */
  .extern PHASE10INV       /* 0xBF82AA0C */
  .extern DTR10            /* 0xBF82AA10 */
  .extern DTR10CLR         /* 0xBF82AA14 */
  .extern DTR10SET         /* 0xBF82AA18 */
  .extern DTR10INV         /* 0xBF82AA1C */
  .extern ALTDTR10         /* 0xBF82AA20 */
  .extern ALTDTR10CLR      /* 0xBF82AA24 */
  .extern ALTDTR10SET      /* 0xBF82AA28 */
  .extern ALTDTR10INV      /* 0xBF82AA2C */
  .extern DTCOMP10         /* 0xBF82AA30 */
  .extern DTCOMP10CLR      /* 0xBF82AA34 */
  .extern DTCOMP10SET      /* 0xBF82AA38 */
  .extern DTCOMP10INV      /* 0xBF82AA3C */
  .extern TRIG10           /* 0xBF82AA40 */
  .extern TRIG10CLR        /* 0xBF82AA44 */
  .extern TRIG10SET        /* 0xBF82AA48 */
  .extern TRIG10INV        /* 0xBF82AA4C */
  .extern TRGCON10         /* 0xBF82AA50 */
  .extern TRGCON10CLR      /* 0xBF82AA54 */
  .extern TRGCON10SET      /* 0xBF82AA58 */
  .extern TRGCON10INV      /* 0xBF82AA5C */
  .extern STRIG10          /* 0xBF82AA60 */
  .extern STRIG10CLR       /* 0xBF82AA64 */
  .extern STRIG10SET       /* 0xBF82AA68 */
  .extern STRIG10INV       /* 0xBF82AA6C */
  .extern CAP10            /* 0xBF82AA70 */
  .extern CAP10CLR         /* 0xBF82AA74 */
  .extern CAP10SET         /* 0xBF82AA78 */
  .extern CAP10INV         /* 0xBF82AA7C */
  .extern LEBCON10         /* 0xBF82AA80 */
  .extern LEBCON10CLR      /* 0xBF82AA84 */
  .extern LEBCON10SET      /* 0xBF82AA88 */
  .extern LEBCON10INV      /* 0xBF82AA8C */
  .extern LEBDLY10         /* 0xBF82AA90 */
  .extern LEBDLY10CLR      /* 0xBF82AA94 */
  .extern LEBDLY10SET      /* 0xBF82AA98 */
  .extern LEBDLY10INV      /* 0xBF82AA9C */
  .extern AUXCON10         /* 0xBF82AAA0 */
  .extern AUXCON10CLR      /* 0xBF82AAA4 */
  .extern AUXCON10SET      /* 0xBF82AAA8 */
  .extern AUXCON10INV      /* 0xBF82AAAC */
  .extern PTMR10           /* 0xBF82AAB0 */
  .extern PTMR10CLR        /* 0xBF82AAB4 */
  .extern PTMR10SET        /* 0xBF82AAB8 */
  .extern PTMR10INV        /* 0xBF82AABC */
  .extern PWMCON11         /* 0xBF82AAC0 */
  .extern PWMCON11CLR      /* 0xBF82AAC4 */
  .extern PWMCON11SET      /* 0xBF82AAC8 */
  .extern PWMCON11INV      /* 0xBF82AACC */
  .extern IOCON11          /* 0xBF82AAD0 */
  .extern IOCON11CLR       /* 0xBF82AAD4 */
  .extern IOCON11SET       /* 0xBF82AAD8 */
  .extern IOCON11INV       /* 0xBF82AADC */
  .extern PDC11            /* 0xBF82AAE0 */
  .extern PDC11CLR         /* 0xBF82AAE4 */
  .extern PDC11SET         /* 0xBF82AAE8 */
  .extern PDC11INV         /* 0xBF82AAEC */
  .extern SDC11            /* 0xBF82AAF0 */
  .extern SDC11CLR         /* 0xBF82AAF4 */
  .extern SDC11SET         /* 0xBF82AAF8 */
  .extern SDC11INV         /* 0xBF82AAFC */
  .extern PHASE11          /* 0xBF82AB00 */
  .extern PHASE11CLR       /* 0xBF82AB04 */
  .extern PHASE11SET       /* 0xBF82AB08 */
  .extern PHASE11INV       /* 0xBF82AB0C */
  .extern DTR11            /* 0xBF82AB10 */
  .extern DTR11CLR         /* 0xBF82AB14 */
  .extern DTR11SET         /* 0xBF82AB18 */
  .extern DTR11INV         /* 0xBF82AB1C */
  .extern ALTDTR11         /* 0xBF82AB20 */
  .extern ALTDTR11CLR      /* 0xBF82AB24 */
  .extern ALTDTR11SET      /* 0xBF82AB28 */
  .extern ALTDTR11INV      /* 0xBF82AB2C */
  .extern DTCOMP11         /* 0xBF82AB30 */
  .extern DTCOMP11CLR      /* 0xBF82AB34 */
  .extern DTCOMP11SET      /* 0xBF82AB38 */
  .extern DTCOMP11INV      /* 0xBF82AB3C */
  .extern TRIG11           /* 0xBF82AB40 */
  .extern TRIG11CLR        /* 0xBF82AB44 */
  .extern TRIG11SET        /* 0xBF82AB48 */
  .extern TRIG11INV        /* 0xBF82AB4C */
  .extern TRGCON11         /* 0xBF82AB50 */
  .extern TRGCON11CLR      /* 0xBF82AB54 */
  .extern TRGCON11SET      /* 0xBF82AB58 */
  .extern TRGCON11INV      /* 0xBF82AB5C */
  .extern STRIG11          /* 0xBF82AB60 */
  .extern STRIG11CLR       /* 0xBF82AB64 */
  .extern STRIG11SET       /* 0xBF82AB68 */
  .extern STRIG11INV       /* 0xBF82AB6C */
  .extern CAP11            /* 0xBF82AB70 */
  .extern CAP11CLR         /* 0xBF82AB74 */
  .extern CAP11SET         /* 0xBF82AB78 */
  .extern CAP11INV         /* 0xBF82AB7C */
  .extern LEBCON11         /* 0xBF82AB80 */
  .extern LEBCON11CLR      /* 0xBF82AB84 */
  .extern LEBCON11SET      /* 0xBF82AB88 */
  .extern LEBCON11INV      /* 0xBF82AB8C */
  .extern LEBDLY11         /* 0xBF82AB90 */
  .extern LEBDLY11CLR      /* 0xBF82AB94 */
  .extern LEBDLY11SET      /* 0xBF82AB98 */
  .extern LEBDLY11INV      /* 0xBF82AB9C */
  .extern AUXCON11         /* 0xBF82ABA0 */
  .extern AUXCON11CLR      /* 0xBF82ABA4 */
  .extern AUXCON11SET      /* 0xBF82ABA8 */
  .extern AUXCON11INV      /* 0xBF82ABAC */
  .extern PTMR11           /* 0xBF82ABB0 */
  .extern PTMR11CLR        /* 0xBF82ABB4 */
  .extern PTMR11SET        /* 0xBF82ABB8 */
  .extern PTMR11INV        /* 0xBF82ABBC */
  .extern PWMCON12         /* 0xBF82ABC0 */
  .extern PWMCON12CLR      /* 0xBF82ABC4 */
  .extern PWMCON12SET      /* 0xBF82ABC8 */
  .extern PWMCON12INV      /* 0xBF82ABCC */
  .extern IOCON12          /* 0xBF82ABD0 */
  .extern IOCON12CLR       /* 0xBF82ABD4 */
  .extern IOCON12SET       /* 0xBF82ABD8 */
  .extern IOCON12INV       /* 0xBF82ABDC */
  .extern PDC12            /* 0xBF82ABE0 */
  .extern PDC12CLR         /* 0xBF82ABE4 */
  .extern PDC12SET         /* 0xBF82ABE8 */
  .extern PDC12INV         /* 0xBF82ABEC */
  .extern SDC12            /* 0xBF82ABF0 */
  .extern SDC12CLR         /* 0xBF82ABF4 */
  .extern SDC12SET         /* 0xBF82ABF8 */
  .extern SDC12INV         /* 0xBF82ABFC */
  .extern PHASE12          /* 0xBF82AC00 */
  .extern PHASE12CLR       /* 0xBF82AC04 */
  .extern PHASE12SET       /* 0xBF82AC08 */
  .extern PHASE12INV       /* 0xBF82AC0C */
  .extern DTR12            /* 0xBF82AC10 */
  .extern DTR12CLR         /* 0xBF82AC14 */
  .extern DTR12SET         /* 0xBF82AC18 */
  .extern DTR12INV         /* 0xBF82AC1C */
  .extern ALTDTR12         /* 0xBF82AC20 */
  .extern ALTDTR12CLR      /* 0xBF82AC24 */
  .extern ALTDTR12SET      /* 0xBF82AC28 */
  .extern ALTDTR12INV      /* 0xBF82AC2C */
  .extern DTCOMP12         /* 0xBF82AC30 */
  .extern DTCOMP12CLR      /* 0xBF82AC34 */
  .extern DTCOMP12SET      /* 0xBF82AC38 */
  .extern DTCOMP12INV      /* 0xBF82AC3C */
  .extern TRIG12           /* 0xBF82AC40 */
  .extern TRIG12CLR        /* 0xBF82AC44 */
  .extern TRIG12SET        /* 0xBF82AC48 */
  .extern TRIG12INV        /* 0xBF82AC4C */
  .extern TRGCON12         /* 0xBF82AC50 */
  .extern TRGCON12CLR      /* 0xBF82AC54 */
  .extern TRGCON12SET      /* 0xBF82AC58 */
  .extern TRGCON12INV      /* 0xBF82AC5C */
  .extern STRIG12          /* 0xBF82AC60 */
  .extern STRIG12CLR       /* 0xBF82AC64 */
  .extern STRIG12SET       /* 0xBF82AC68 */
  .extern STRIG12INV       /* 0xBF82AC6C */
  .extern CAP12            /* 0xBF82AC70 */
  .extern CAP12CLR         /* 0xBF82AC74 */
  .extern CAP12SET         /* 0xBF82AC78 */
  .extern CAP12INV         /* 0xBF82AC7C */
  .extern LEBCON12         /* 0xBF82AC80 */
  .extern LEBCON12CLR      /* 0xBF82AC84 */
  .extern LEBCON12SET      /* 0xBF82AC88 */
  .extern LEBCON12INV      /* 0xBF82AC8C */
  .extern LEBDLY12         /* 0xBF82AC90 */
  .extern LEBDLY12CLR      /* 0xBF82AC94 */
  .extern LEBDLY12SET      /* 0xBF82AC98 */
  .extern LEBDLY12INV      /* 0xBF82AC9C */
  .extern AUXCON12         /* 0xBF82ACA0 */
  .extern AUXCON12CLR      /* 0xBF82ACA4 */
  .extern AUXCON12SET      /* 0xBF82ACA8 */
  .extern AUXCON12INV      /* 0xBF82ACAC */
  .extern PTMR12           /* 0xBF82ACB0 */
  .extern PTMR12CLR        /* 0xBF82ACB4 */
  .extern PTMR12SET        /* 0xBF82ACB8 */
  .extern PTMR12INV        /* 0xBF82ACBC */
  .extern PTGCON           /* 0xBF82B000 */
  .extern PTGCONCLR        /* 0xBF82B004 */
  .extern PTGCONSET        /* 0xBF82B008 */
  .extern PTGCONINV        /* 0xBF82B00C */
  .extern PTGBTE           /* 0xBF82B010 */
  .extern PTGBTECLR        /* 0xBF82B014 */
  .extern PTGBTESET        /* 0xBF82B018 */
  .extern PTGBTEINV        /* 0xBF82B01C */
  .extern PTGHOLD          /* 0xBF82B020 */
  .extern PTGHOLDCLR       /* 0xBF82B024 */
  .extern PTGHOLDSET       /* 0xBF82B028 */
  .extern PTGHOLDINV       /* 0xBF82B02C */
  .extern PTGT0LIM         /* 0xBF82B030 */
  .extern PTGT0LIMCLR      /* 0xBF82B034 */
  .extern PTGT0LIMSET      /* 0xBF82B038 */
  .extern PTGT0LIMINV      /* 0xBF82B03C */
  .extern PTGT1LIM         /* 0xBF82B040 */
  .extern PTGT1LIMCLR      /* 0xBF82B044 */
  .extern PTGT1LIMSET      /* 0xBF82B048 */
  .extern PTGT1LIMINV      /* 0xBF82B04C */
  .extern PTGSDLIM         /* 0xBF82B050 */
  .extern PTGSDLIMCLR      /* 0xBF82B054 */
  .extern PTGSDLIMSET      /* 0xBF82B058 */
  .extern PTGSDLIMINV      /* 0xBF82B05C */
  .extern PTGC0LIM         /* 0xBF82B060 */
  .extern PTGC0LIMCLR      /* 0xBF82B064 */
  .extern PTGC0LIMSET      /* 0xBF82B068 */
  .extern PTGC0LIMINV      /* 0xBF82B06C */
  .extern PTGC1LIM         /* 0xBF82B070 */
  .extern PTGC1LIMCLR      /* 0xBF82B074 */
  .extern PTGC1LIMSET      /* 0xBF82B078 */
  .extern PTGC1LIMINV      /* 0xBF82B07C */
  .extern PTGADJ           /* 0xBF82B080 */
  .extern PTGADJCLR        /* 0xBF82B084 */
  .extern PTGADJSET        /* 0xBF82B088 */
  .extern PTGADJINV        /* 0xBF82B08C */
  .extern PTGL0            /* 0xBF82B090 */
  .extern PTGL0CLR         /* 0xBF82B094 */
  .extern PTGL0SET         /* 0xBF82B098 */
  .extern PTGL0INV         /* 0xBF82B09C */
  .extern PTGQPTR          /* 0xBF82B0A0 */
  .extern PTGQPTRCLR       /* 0xBF82B0A4 */
  .extern PTGQPTRSET       /* 0xBF82B0A8 */
  .extern PTGQPTRINV       /* 0xBF82B0AC */
  .extern PTGQUE0          /* 0xBF82B0C0 */
  .extern PTGQUE0CLR       /* 0xBF82B0C4 */
  .extern PTGQUE0SET       /* 0xBF82B0C8 */
  .extern PTGQUE0INV       /* 0xBF82B0CC */
  .extern PTGQUE1          /* 0xBF82B0D0 */
  .extern PTGQUE1CLR       /* 0xBF82B0D4 */
  .extern PTGQUE1SET       /* 0xBF82B0D8 */
  .extern PTGQUE1INV       /* 0xBF82B0DC */
  .extern PTGQUE2          /* 0xBF82B0E0 */
  .extern PTGQUE2CLR       /* 0xBF82B0E4 */
  .extern PTGQUE2SET       /* 0xBF82B0E8 */
  .extern PTGQUE2INV       /* 0xBF82B0EC */
  .extern PTGQUE3          /* 0xBF82B0F0 */
  .extern PTGQUE3CLR       /* 0xBF82B0F4 */
  .extern PTGQUE3SET       /* 0xBF82B0F8 */
  .extern PTGQUE3INV       /* 0xBF82B0FC */
  .extern PTGQUE4          /* 0xBF82B100 */
  .extern PTGQUE4CLR       /* 0xBF82B104 */
  .extern PTGQUE4SET       /* 0xBF82B108 */
  .extern PTGQUE4INV       /* 0xBF82B10C */
  .extern PTGQUE5          /* 0xBF82B110 */
  .extern PTGQUE5CLR       /* 0xBF82B114 */
  .extern PTGQUE5SET       /* 0xBF82B118 */
  .extern PTGQUE5INV       /* 0xBF82B11C */
  .extern PTGQUE6          /* 0xBF82B120 */
  .extern PTGQUE6CLR       /* 0xBF82B124 */
  .extern PTGQUE6SET       /* 0xBF82B128 */
  .extern PTGQUE6INV       /* 0xBF82B12C */
  .extern PTGQUE7          /* 0xBF82B130 */
  .extern PTGQUE7CLR       /* 0xBF82B134 */
  .extern PTGQUE7SET       /* 0xBF82B138 */
