Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0512mcf064.h
  .extern C3FIFOUA11       /* 0xBF884630 */
  .extern C3FIFOUA11CLR    /* 0xBF884634 */
  .extern C3FIFOUA11SET    /* 0xBF884638 */
  .extern C3FIFOUA11INV    /* 0xBF88463C */
  .extern C3FIFOCI11       /* 0xBF884640 */
  .extern C3FIFOCI11CLR    /* 0xBF884644 */
  .extern C3FIFOCI11SET    /* 0xBF884648 */
  .extern C3FIFOCI11INV    /* 0xBF88464C */
  .extern C3FIFOCON12      /* 0xBF884650 */
  .extern C3FIFOCON12CLR   /* 0xBF884654 */
  .extern C3FIFOCON12SET   /* 0xBF884658 */
  .extern C3FIFOCON12INV   /* 0xBF88465C */
  .extern C3FIFOINT12      /* 0xBF884660 */
  .extern C3FIFOINT12CLR   /* 0xBF884664 */
  .extern C3FIFOINT12SET   /* 0xBF884668 */
  .extern C3FIFOINT12INV   /* 0xBF88466C */
  .extern C3FIFOUA12       /* 0xBF884670 */
  .extern C3FIFOUA12CLR    /* 0xBF884674 */
  .extern C3FIFOUA12SET    /* 0xBF884678 */
  .extern C3FIFOUA12INV    /* 0xBF88467C */
  .extern C3FIFOCI12       /* 0xBF884680 */
  .extern C3FIFOCI12CLR    /* 0xBF884684 */
  .extern C3FIFOCI12SET    /* 0xBF884688 */
  .extern C3FIFOCI12INV    /* 0xBF88468C */
  .extern C3FIFOCON13      /* 0xBF884690 */
  .extern C3FIFOCON13CLR   /* 0xBF884694 */
  .extern C3FIFOCON13SET   /* 0xBF884698 */
  .extern C3FIFOCON13INV   /* 0xBF88469C */
  .extern C3FIFOINT13      /* 0xBF8846A0 */
  .extern C3FIFOINT13CLR   /* 0xBF8846A4 */
  .extern C3FIFOINT13SET   /* 0xBF8846A8 */
  .extern C3FIFOINT13INV   /* 0xBF8846AC */
  .extern C3FIFOUA13       /* 0xBF8846B0 */
  .extern C3FIFOUA13CLR    /* 0xBF8846B4 */
  .extern C3FIFOUA13SET    /* 0xBF8846B8 */
  .extern C3FIFOUA13INV    /* 0xBF8846BC */
  .extern C3FIFOCI13       /* 0xBF8846C0 */
  .extern C3FIFOCI13CLR    /* 0xBF8846C4 */
  .extern C3FIFOCI13SET    /* 0xBF8846C8 */
  .extern C3FIFOCI13INV    /* 0xBF8846CC */
  .extern C3FIFOCON14      /* 0xBF8846D0 */
  .extern C3FIFOCON14CLR   /* 0xBF8846D4 */
  .extern C3FIFOCON14SET   /* 0xBF8846D8 */
  .extern C3FIFOCON14INV   /* 0xBF8846DC */
  .extern C3FIFOINT14      /* 0xBF8846E0 */
  .extern C3FIFOINT14CLR   /* 0xBF8846E4 */
  .extern C3FIFOINT14SET   /* 0xBF8846E8 */
  .extern C3FIFOINT14INV   /* 0xBF8846EC */
  .extern C3FIFOUA14       /* 0xBF8846F0 */
  .extern C3FIFOUA14CLR    /* 0xBF8846F4 */
  .extern C3FIFOUA14SET    /* 0xBF8846F8 */
  .extern C3FIFOUA14INV    /* 0xBF8846FC */
  .extern C3FIFOCI14       /* 0xBF884700 */
  .extern C3FIFOCI14CLR    /* 0xBF884704 */
  .extern C3FIFOCI14SET    /* 0xBF884708 */
  .extern C3FIFOCI14INV    /* 0xBF88470C */
  .extern C3FIFOCON15      /* 0xBF884710 */
  .extern C3FIFOCON15CLR   /* 0xBF884714 */
  .extern C3FIFOCON15SET   /* 0xBF884718 */
  .extern C3FIFOCON15INV   /* 0xBF88471C */
  .extern C3FIFOINT15      /* 0xBF884720 */
  .extern C3FIFOINT15CLR   /* 0xBF884724 */
  .extern C3FIFOINT15SET   /* 0xBF884728 */
  .extern C3FIFOINT15INV   /* 0xBF88472C */
  .extern C3FIFOUA15       /* 0xBF884730 */
  .extern C3FIFOUA15CLR    /* 0xBF884734 */
  .extern C3FIFOUA15SET    /* 0xBF884738 */
  .extern C3FIFOUA15INV    /* 0xBF88473C */
  .extern C3FIFOCI15       /* 0xBF884740 */
  .extern C3FIFOCI15CLR    /* 0xBF884744 */
  .extern C3FIFOCI15SET    /* 0xBF884748 */
  .extern C3FIFOCI15INV    /* 0xBF88474C */
  .extern C4CON            /* 0xBF885000 */
  .extern C4CONCLR         /* 0xBF885004 */
  .extern C4CONSET         /* 0xBF885008 */
  .extern C4CONINV         /* 0xBF88500C */
  .extern C4CFG            /* 0xBF885010 */
  .extern C4CFGCLR         /* 0xBF885014 */
  .extern C4CFGSET         /* 0xBF885018 */
  .extern C4CFGINV         /* 0xBF88501C */
  .extern C4INT            /* 0xBF885020 */
  .extern C4INTCLR         /* 0xBF885024 */
  .extern C4INTSET         /* 0xBF885028 */
  .extern C4INTINV         /* 0xBF88502C */
  .extern C4VEC            /* 0xBF885030 */
  .extern C4VECCLR         /* 0xBF885034 */
  .extern C4VECSET         /* 0xBF885038 */
  .extern C4VECINV         /* 0xBF88503C */
  .extern C4TREC           /* 0xBF885040 */
  .extern C4TRECCLR        /* 0xBF885044 */
  .extern C4TRECSET        /* 0xBF885048 */
  .extern C4TRECINV        /* 0xBF88504C */
  .extern C4FSTAT          /* 0xBF885050 */
  .extern C4FSTATCLR       /* 0xBF885054 */
  .extern C4FSTATSET       /* 0xBF885058 */
  .extern C4FSTATINV       /* 0xBF88505C */
  .extern C4RXOVF          /* 0xBF885060 */
  .extern C4RXOVFCLR       /* 0xBF885064 */
  .extern C4RXOVFSET       /* 0xBF885068 */
  .extern C4RXOVFINV       /* 0xBF88506C */
  .extern C4TMR            /* 0xBF885070 */
  .extern C4TMRCLR         /* 0xBF885074 */
  .extern C4TMRSET         /* 0xBF885078 */
  .extern C4TMRINV         /* 0xBF88507C */
  .extern C4RXM0           /* 0xBF885080 */
  .extern C4RXM0CLR        /* 0xBF885084 */
  .extern C4RXM0SET        /* 0xBF885088 */
  .extern C4RXM0INV        /* 0xBF88508C */
  .extern C4RXM1           /* 0xBF885090 */
  .extern C4RXM1CLR        /* 0xBF885094 */
  .extern C4RXM1SET        /* 0xBF885098 */
  .extern C4RXM1INV        /* 0xBF88509C */
  .extern C4RXM2           /* 0xBF8850A0 */
  .extern C4RXM2CLR        /* 0xBF8850A4 */
  .extern C4RXM2SET        /* 0xBF8850A8 */
  .extern C4RXM2INV        /* 0xBF8850AC */
  .extern C4RXM3           /* 0xBF8850B0 */
  .extern C4RXM3CLR        /* 0xBF8850B4 */
  .extern C4RXM3SET        /* 0xBF8850B8 */
  .extern C4RXM3INV        /* 0xBF8850BC */
  .extern C4FLTCON0        /* 0xBF8850C0 */
  .extern C4FLTCON0CLR     /* 0xBF8850C4 */
  .extern C4FLTCON0SET     /* 0xBF8850C8 */
  .extern C4FLTCON0INV     /* 0xBF8850CC */
  .extern C4FLTCON1        /* 0xBF8850D0 */
  .extern C4FLTCON1CLR     /* 0xBF8850D4 */
  .extern C4FLTCON1SET     /* 0xBF8850D8 */
  .extern C4FLTCON1INV     /* 0xBF8850DC */
  .extern C4FLTCON2        /* 0xBF8850E0 */
  .extern C4FLTCON2CLR     /* 0xBF8850E4 */
  .extern C4FLTCON2SET     /* 0xBF8850E8 */
  .extern C4FLTCON2INV     /* 0xBF8850EC */
  .extern C4FLTCON3        /* 0xBF8850F0 */
  .extern C4FLTCON3CLR     /* 0xBF8850F4 */
  .extern C4FLTCON3SET     /* 0xBF8850F8 */
  .extern C4FLTCON3INV     /* 0xBF8850FC */
  .extern C4RXF0           /* 0xBF885140 */
  .extern C4RXF0CLR        /* 0xBF885144 */
  .extern C4RXF0SET        /* 0xBF885148 */
  .extern C4RXF0INV        /* 0xBF88514C */
  .extern C4RXF1           /* 0xBF885150 */
  .extern C4RXF1CLR        /* 0xBF885154 */
  .extern C4RXF1SET        /* 0xBF885158 */
  .extern C4RXF1INV        /* 0xBF88515C */
  .extern C4RXF2           /* 0xBF885160 */
  .extern C4RXF2CLR        /* 0xBF885164 */
  .extern C4RXF2SET        /* 0xBF885168 */
  .extern C4RXF2INV        /* 0xBF88516C */
  .extern C4RXF3           /* 0xBF885170 */
  .extern C4RXF3CLR        /* 0xBF885174 */
  .extern C4RXF3SET        /* 0xBF885178 */
  .extern C4RXF3INV        /* 0xBF88517C */
  .extern C4RXF4           /* 0xBF885180 */
  .extern C4RXF4CLR        /* 0xBF885184 */
  .extern C4RXF4SET        /* 0xBF885188 */
  .extern C4RXF4INV        /* 0xBF88518C */
  .extern C4RXF5           /* 0xBF885190 */
  .extern C4RXF5CLR        /* 0xBF885194 */
  .extern C4RXF5SET        /* 0xBF885198 */
  .extern C4RXF5INV        /* 0xBF88519C */
  .extern C4RXF6           /* 0xBF8851A0 */
  .extern C4RXF6CLR        /* 0xBF8851A4 */
  .extern C4RXF6SET        /* 0xBF8851A8 */
  .extern C4RXF6INV        /* 0xBF8851AC */
  .extern C4RXF7           /* 0xBF8851B0 */
  .extern C4RXF7CLR        /* 0xBF8851B4 */
  .extern C4RXF7SET        /* 0xBF8851B8 */
  .extern C4RXF7INV        /* 0xBF8851BC */
  .extern C4RXF8           /* 0xBF8851C0 */
  .extern C4RXF8CLR        /* 0xBF8851C4 */
  .extern C4RXF8SET        /* 0xBF8851C8 */
  .extern C4RXF8INV        /* 0xBF8851CC */
  .extern C4RXF9           /* 0xBF8851D0 */
  .extern C4RXF9CLR        /* 0xBF8851D4 */
  .extern C4RXF9SET        /* 0xBF8851D8 */
  .extern C4RXF9INV        /* 0xBF8851DC */
  .extern C4RXF10          /* 0xBF8851E0 */
  .extern C4RXF10CLR       /* 0xBF8851E4 */
  .extern C4RXF10SET       /* 0xBF8851E8 */
  .extern C4RXF10INV       /* 0xBF8851EC */
  .extern C4RXF11          /* 0xBF8851F0 */
  .extern C4RXF11CLR       /* 0xBF8851F4 */
  .extern C4RXF11SET       /* 0xBF8851F8 */
  .extern C4RXF11INV       /* 0xBF8851FC */
  .extern C4RXF12          /* 0xBF885200 */
  .extern C4RXF12CLR       /* 0xBF885204 */
  .extern C4RXF12SET       /* 0xBF885208 */
  .extern C4RXF12INV       /* 0xBF88520C */
  .extern C4RXF13          /* 0xBF885210 */
  .extern C4RXF13CLR       /* 0xBF885214 */
  .extern C4RXF13SET       /* 0xBF885218 */
  .extern C4RXF13INV       /* 0xBF88521C */
  .extern C4RXF14          /* 0xBF885220 */
  .extern C4RXF14CLR       /* 0xBF885224 */
  .extern C4RXF14SET       /* 0xBF885228 */
  .extern C4RXF14INV       /* 0xBF88522C */
  .extern C4RXF15          /* 0xBF885230 */
  .extern C4RXF15CLR       /* 0xBF885234 */
  .extern C4RXF15SET       /* 0xBF885238 */
  .extern C4RXF15INV       /* 0xBF88523C */
  .extern C4FIFOBA         /* 0xBF885340 */
  .extern C4FIFOBACLR      /* 0xBF885344 */
  .extern C4FIFOBASET      /* 0xBF885348 */
  .extern C4FIFOBAINV      /* 0xBF88534C */
  .extern C4FIFOCON0       /* 0xBF885350 */
  .extern C4FIFOCON0CLR    /* 0xBF885354 */
  .extern C4FIFOCON0SET    /* 0xBF885358 */
  .extern C4FIFOCON0INV    /* 0xBF88535C */
  .extern C4FIFOINT0       /* 0xBF885360 */
  .extern C4FIFOINT0CLR    /* 0xBF885364 */
  .extern C4FIFOINT0SET    /* 0xBF885368 */
  .extern C4FIFOINT0INV    /* 0xBF88536C */
  .extern C4FIFOUA0        /* 0xBF885370 */
  .extern C4FIFOUA0CLR     /* 0xBF885374 */
  .extern C4FIFOUA0SET     /* 0xBF885378 */
  .extern C4FIFOUA0INV     /* 0xBF88537C */
  .extern C4FIFOCI0        /* 0xBF885380 */
  .extern C4FIFOCI0CLR     /* 0xBF885384 */
  .extern C4FIFOCI0SET     /* 0xBF885388 */
  .extern C4FIFOCI0INV     /* 0xBF88538C */
  .extern C4FIFOCON1       /* 0xBF885390 */
  .extern C4FIFOCON1CLR    /* 0xBF885394 */
  .extern C4FIFOCON1SET    /* 0xBF885398 */
  .extern C4FIFOCON1INV    /* 0xBF88539C */
  .extern C4FIFOINT1       /* 0xBF8853A0 */
  .extern C4FIFOINT1CLR    /* 0xBF8853A4 */
  .extern C4FIFOINT1SET    /* 0xBF8853A8 */
  .extern C4FIFOINT1INV    /* 0xBF8853AC */
  .extern C4FIFOUA1        /* 0xBF8853B0 */
  .extern C4FIFOUA1CLR     /* 0xBF8853B4 */
  .extern C4FIFOUA1SET     /* 0xBF8853B8 */
  .extern C4FIFOUA1INV     /* 0xBF8853BC */
  .extern C4FIFOCI1        /* 0xBF8853C0 */
  .extern C4FIFOCI1CLR     /* 0xBF8853C4 */
  .extern C4FIFOCI1SET     /* 0xBF8853C8 */
  .extern C4FIFOCI1INV     /* 0xBF8853CC */
  .extern C4FIFOCON2       /* 0xBF8853D0 */
  .extern C4FIFOCON2CLR    /* 0xBF8853D4 */
  .extern C4FIFOCON2SET    /* 0xBF8853D8 */
  .extern C4FIFOCON2INV    /* 0xBF8853DC */
  .extern C4FIFOINT2       /* 0xBF8853E0 */
  .extern C4FIFOINT2CLR    /* 0xBF8853E4 */
  .extern C4FIFOINT2SET    /* 0xBF8853E8 */
  .extern C4FIFOINT2INV    /* 0xBF8853EC */
  .extern C4FIFOUA2        /* 0xBF8853F0 */
  .extern C4FIFOUA2CLR     /* 0xBF8853F4 */
  .extern C4FIFOUA2SET     /* 0xBF8853F8 */
  .extern C4FIFOUA2INV     /* 0xBF8853FC */
  .extern C4FIFOCI2        /* 0xBF885400 */
  .extern C4FIFOCI2CLR     /* 0xBF885404 */
  .extern C4FIFOCI2SET     /* 0xBF885408 */
  .extern C4FIFOCI2INV     /* 0xBF88540C */
  .extern C4FIFOCON3       /* 0xBF885410 */
  .extern C4FIFOCON3CLR    /* 0xBF885414 */
  .extern C4FIFOCON3SET    /* 0xBF885418 */
  .extern C4FIFOCON3INV    /* 0xBF88541C */
  .extern C4FIFOINT3       /* 0xBF885420 */
  .extern C4FIFOINT3CLR    /* 0xBF885424 */
  .extern C4FIFOINT3SET    /* 0xBF885428 */
  .extern C4FIFOINT3INV    /* 0xBF88542C */
  .extern C4FIFOUA3        /* 0xBF885430 */
  .extern C4FIFOUA3CLR     /* 0xBF885434 */
  .extern C4FIFOUA3SET     /* 0xBF885438 */
  .extern C4FIFOUA3INV     /* 0xBF88543C */
  .extern C4FIFOCI3        /* 0xBF885440 */
  .extern C4FIFOCI3CLR     /* 0xBF885444 */
  .extern C4FIFOCI3SET     /* 0xBF885448 */
  .extern C4FIFOCI3INV     /* 0xBF88544C */
  .extern C4FIFOCON4       /* 0xBF885450 */
  .extern C4FIFOCON4CLR    /* 0xBF885454 */
  .extern C4FIFOCON4SET    /* 0xBF885458 */
  .extern C4FIFOCON4INV    /* 0xBF88545C */
  .extern C4FIFOINT4       /* 0xBF885460 */
  .extern C4FIFOINT4CLR    /* 0xBF885464 */
  .extern C4FIFOINT4SET    /* 0xBF885468 */
  .extern C4FIFOINT4INV    /* 0xBF88546C */
  .extern C4FIFOUA4        /* 0xBF885470 */
  .extern C4FIFOUA4CLR     /* 0xBF885474 */
  .extern C4FIFOUA4SET     /* 0xBF885478 */
  .extern C4FIFOUA4INV     /* 0xBF88547C */
  .extern C4FIFOCI4        /* 0xBF885480 */
  .extern C4FIFOCI4CLR     /* 0xBF885484 */
  .extern C4FIFOCI4SET     /* 0xBF885488 */
  .extern C4FIFOCI4INV     /* 0xBF88548C */
  .extern C4FIFOCON5       /* 0xBF885490 */
  .extern C4FIFOCON5CLR    /* 0xBF885494 */
  .extern C4FIFOCON5SET    /* 0xBF885498 */
  .extern C4FIFOCON5INV    /* 0xBF88549C */
  .extern C4FIFOINT5       /* 0xBF8854A0 */
  .extern C4FIFOINT5CLR    /* 0xBF8854A4 */
  .extern C4FIFOINT5SET    /* 0xBF8854A8 */
  .extern C4FIFOINT5INV    /* 0xBF8854AC */
  .extern C4FIFOUA5        /* 0xBF8854B0 */
  .extern C4FIFOUA5CLR     /* 0xBF8854B4 */
  .extern C4FIFOUA5SET     /* 0xBF8854B8 */
  .extern C4FIFOUA5INV     /* 0xBF8854BC */
  .extern C4FIFOCI5        /* 0xBF8854C0 */
  .extern C4FIFOCI5CLR     /* 0xBF8854C4 */
  .extern C4FIFOCI5SET     /* 0xBF8854C8 */
  .extern C4FIFOCI5INV     /* 0xBF8854CC */
  .extern C4FIFOCON6       /* 0xBF8854D0 */
  .extern C4FIFOCON6CLR    /* 0xBF8854D4 */
  .extern C4FIFOCON6SET    /* 0xBF8854D8 */
  .extern C4FIFOCON6INV    /* 0xBF8854DC */
  .extern C4FIFOINT6       /* 0xBF8854E0 */
  .extern C4FIFOINT6CLR    /* 0xBF8854E4 */
  .extern C4FIFOINT6SET    /* 0xBF8854E8 */
  .extern C4FIFOINT6INV    /* 0xBF8854EC */
  .extern C4FIFOUA6        /* 0xBF8854F0 */
  .extern C4FIFOUA6CLR     /* 0xBF8854F4 */
  .extern C4FIFOUA6SET     /* 0xBF8854F8 */
  .extern C4FIFOUA6INV     /* 0xBF8854FC */
  .extern C4FIFOCI6        /* 0xBF885500 */
  .extern C4FIFOCI6CLR     /* 0xBF885504 */
  .extern C4FIFOCI6SET     /* 0xBF885508 */
  .extern C4FIFOCI6INV     /* 0xBF88550C */
  .extern C4FIFOCON7       /* 0xBF885510 */
  .extern C4FIFOCON7CLR    /* 0xBF885514 */
  .extern C4FIFOCON7SET    /* 0xBF885518 */
  .extern C4FIFOCON7INV    /* 0xBF88551C */
  .extern C4FIFOINT7       /* 0xBF885520 */
  .extern C4FIFOINT7CLR    /* 0xBF885524 */
  .extern C4FIFOINT7SET    /* 0xBF885528 */
  .extern C4FIFOINT7INV    /* 0xBF88552C */
  .extern C4FIFOUA7        /* 0xBF885530 */
  .extern C4FIFOUA7CLR     /* 0xBF885534 */
  .extern C4FIFOUA7SET     /* 0xBF885538 */
  .extern C4FIFOUA7INV     /* 0xBF88553C */
  .extern C4FIFOCI7        /* 0xBF885540 */
  .extern C4FIFOCI7CLR     /* 0xBF885544 */
  .extern C4FIFOCI7SET     /* 0xBF885548 */
  .extern C4FIFOCI7INV     /* 0xBF88554C */
  .extern C4FIFOCON8       /* 0xBF885550 */
  .extern C4FIFOCON8CLR    /* 0xBF885554 */
  .extern C4FIFOCON8SET    /* 0xBF885558 */
  .extern C4FIFOCON8INV    /* 0xBF88555C */
  .extern C4FIFOINT8       /* 0xBF885560 */
  .extern C4FIFOINT8CLR    /* 0xBF885564 */
  .extern C4FIFOINT8SET    /* 0xBF885568 */
  .extern C4FIFOINT8INV    /* 0xBF88556C */
  .extern C4FIFOUA8        /* 0xBF885570 */
  .extern C4FIFOUA8CLR     /* 0xBF885574 */
  .extern C4FIFOUA8SET     /* 0xBF885578 */
  .extern C4FIFOUA8INV     /* 0xBF88557C */
  .extern C4FIFOCI8        /* 0xBF885580 */
  .extern C4FIFOCI8CLR     /* 0xBF885584 */
  .extern C4FIFOCI8SET     /* 0xBF885588 */
  .extern C4FIFOCI8INV     /* 0xBF88558C */
  .extern C4FIFOCON9       /* 0xBF885590 */
  .extern C4FIFOCON9CLR    /* 0xBF885594 */
  .extern C4FIFOCON9SET    /* 0xBF885598 */
  .extern C4FIFOCON9INV    /* 0xBF88559C */
  .extern C4FIFOINT9       /* 0xBF8855A0 */
  .extern C4FIFOINT9CLR    /* 0xBF8855A4 */
  .extern C4FIFOINT9SET    /* 0xBF8855A8 */
  .extern C4FIFOINT9INV    /* 0xBF8855AC */
  .extern C4FIFOUA9        /* 0xBF8855B0 */
  .extern C4FIFOUA9CLR     /* 0xBF8855B4 */
  .extern C4FIFOUA9SET     /* 0xBF8855B8 */
  .extern C4FIFOUA9INV     /* 0xBF8855BC */
  .extern C4FIFOCI9        /* 0xBF8855C0 */
  .extern C4FIFOCI9CLR     /* 0xBF8855C4 */
  .extern C4FIFOCI9SET     /* 0xBF8855C8 */
  .extern C4FIFOCI9INV     /* 0xBF8855CC */
  .extern C4FIFOCON10      /* 0xBF8855D0 */
  .extern C4FIFOCON10CLR   /* 0xBF8855D4 */
  .extern C4FIFOCON10SET   /* 0xBF8855D8 */
  .extern C4FIFOCON10INV   /* 0xBF8855DC */
  .extern C4FIFOINT10      /* 0xBF8855E0 */
  .extern C4FIFOINT10CLR   /* 0xBF8855E4 */
  .extern C4FIFOINT10SET   /* 0xBF8855E8 */
  .extern C4FIFOINT10INV   /* 0xBF8855EC */
  .extern C4FIFOUA10       /* 0xBF8855F0 */
  .extern C4FIFOUA10CLR    /* 0xBF8855F4 */
  .extern C4FIFOUA10SET    /* 0xBF8855F8 */
  .extern C4FIFOUA10INV    /* 0xBF8855FC */
  .extern C4FIFOCI10       /* 0xBF885600 */
  .extern C4FIFOCI10CLR    /* 0xBF885604 */
  .extern C4FIFOCI10SET    /* 0xBF885608 */
  .extern C4FIFOCI10INV    /* 0xBF88560C */
  .extern C4FIFOCON11      /* 0xBF885610 */
  .extern C4FIFOCON11CLR   /* 0xBF885614 */
  .extern C4FIFOCON11SET   /* 0xBF885618 */
  .extern C4FIFOCON11INV   /* 0xBF88561C */
  .extern C4FIFOINT11      /* 0xBF885620 */
  .extern C4FIFOINT11CLR   /* 0xBF885624 */
  .extern C4FIFOINT11SET   /* 0xBF885628 */
  .extern C4FIFOINT11INV   /* 0xBF88562C */
  .extern C4FIFOUA11       /* 0xBF885630 */
  .extern C4FIFOUA11CLR    /* 0xBF885634 */
  .extern C4FIFOUA11SET    /* 0xBF885638 */
  .extern C4FIFOUA11INV    /* 0xBF88563C */
  .extern C4FIFOCI11       /* 0xBF885640 */
  .extern C4FIFOCI11CLR    /* 0xBF885644 */
  .extern C4FIFOCI11SET    /* 0xBF885648 */
  .extern C4FIFOCI11INV    /* 0xBF88564C */
  .extern C4FIFOCON12      /* 0xBF885650 */
  .extern C4FIFOCON12CLR   /* 0xBF885654 */
  .extern C4FIFOCON12SET   /* 0xBF885658 */
  .extern C4FIFOCON12INV   /* 0xBF88565C */
  .extern C4FIFOINT12      /* 0xBF885660 */
  .extern C4FIFOINT12CLR   /* 0xBF885664 */
  .extern C4FIFOINT12SET   /* 0xBF885668 */
  .extern C4FIFOINT12INV   /* 0xBF88566C */
  .extern C4FIFOUA12       /* 0xBF885670 */
  .extern C4FIFOUA12CLR    /* 0xBF885674 */
  .extern C4FIFOUA12SET    /* 0xBF885678 */
  .extern C4FIFOUA12INV    /* 0xBF88567C */
  .extern C4FIFOCI12       /* 0xBF885680 */
  .extern C4FIFOCI12CLR    /* 0xBF885684 */
  .extern C4FIFOCI12SET    /* 0xBF885688 */
  .extern C4FIFOCI12INV    /* 0xBF88568C */
  .extern C4FIFOCON13      /* 0xBF885690 */
  .extern C4FIFOCON13CLR   /* 0xBF885694 */
  .extern C4FIFOCON13SET   /* 0xBF885698 */
  .extern C4FIFOCON13INV   /* 0xBF88569C */
  .extern C4FIFOINT13      /* 0xBF8856A0 */
  .extern C4FIFOINT13CLR   /* 0xBF8856A4 */
  .extern C4FIFOINT13SET   /* 0xBF8856A8 */
  .extern C4FIFOINT13INV   /* 0xBF8856AC */
  .extern C4FIFOUA13       /* 0xBF8856B0 */
  .extern C4FIFOUA13CLR    /* 0xBF8856B4 */
  .extern C4FIFOUA13SET    /* 0xBF8856B8 */
  .extern C4FIFOUA13INV    /* 0xBF8856BC */
  .extern C4FIFOCI13       /* 0xBF8856C0 */
  .extern C4FIFOCI13CLR    /* 0xBF8856C4 */
  .extern C4FIFOCI13SET    /* 0xBF8856C8 */
  .extern C4FIFOCI13INV    /* 0xBF8856CC */
  .extern C4FIFOCON14      /* 0xBF8856D0 */
  .extern C4FIFOCON14CLR   /* 0xBF8856D4 */
  .extern C4FIFOCON14SET   /* 0xBF8856D8 */
  .extern C4FIFOCON14INV   /* 0xBF8856DC */
  .extern C4FIFOINT14      /* 0xBF8856E0 */
  .extern C4FIFOINT14CLR   /* 0xBF8856E4 */
  .extern C4FIFOINT14SET   /* 0xBF8856E8 */
  .extern C4FIFOINT14INV   /* 0xBF8856EC */
  .extern C4FIFOUA14       /* 0xBF8856F0 */
  .extern C4FIFOUA14CLR    /* 0xBF8856F4 */
  .extern C4FIFOUA14SET    /* 0xBF8856F8 */
  .extern C4FIFOUA14INV    /* 0xBF8856FC */
  .extern C4FIFOCI14       /* 0xBF885700 */
  .extern C4FIFOCI14CLR    /* 0xBF885704 */
  .extern C4FIFOCI14SET    /* 0xBF885708 */
  .extern C4FIFOCI14INV    /* 0xBF88570C */
  .extern C4FIFOCON15      /* 0xBF885710 */
  .extern C4FIFOCON15CLR   /* 0xBF885714 */
  .extern C4FIFOCON15SET   /* 0xBF885718 */
  .extern C4FIFOCON15INV   /* 0xBF88571C */
  .extern C4FIFOINT15      /* 0xBF885720 */
  .extern C4FIFOINT15CLR   /* 0xBF885724 */
  .extern C4FIFOINT15SET   /* 0xBF885728 */
  .extern C4FIFOINT15INV   /* 0xBF88572C */
  .extern C4FIFOUA15       /* 0xBF885730 */
  .extern C4FIFOUA15CLR    /* 0xBF885734 */
  .extern C4FIFOUA15SET    /* 0xBF885738 */
  .extern C4FIFOUA15INV    /* 0xBF88573C */
  .extern C4FIFOCI15       /* 0xBF885740 */
  .extern C4FIFOCI15CLR    /* 0xBF885744 */
  .extern C4FIFOCI15SET    /* 0xBF885748 */
  .extern C4FIFOCI15INV    /* 0xBF88574C */
  .extern ADCCON1          /* 0xBF887000 */
  .extern ADCCON1CLR       /* 0xBF887004 */
  .extern ADCCON1SET       /* 0xBF887008 */
  .extern ADCCON1INV       /* 0xBF88700C */
  .extern ADCCON2          /* 0xBF887010 */
  .extern ADCCON2CLR       /* 0xBF887014 */
  .extern ADCCON2SET       /* 0xBF887018 */
  .extern ADCCON2INV       /* 0xBF88701C */
  .extern ADCCON3          /* 0xBF887020 */
  .extern ADCCON3CLR       /* 0xBF887024 */
  .extern ADCCON3SET       /* 0xBF887028 */
  .extern ADCCON3INV       /* 0xBF88702C */
  .extern ADCTRGMODE       /* 0xBF887030 */
  .extern ADCTRGMODECLR    /* 0xBF887034 */
  .extern ADCTRGMODESET    /* 0xBF887038 */
  .extern ADCTRGMODEINV    /* 0xBF88703C */
  .extern ADCIMCON1        /* 0xBF887040 */
  .extern ADCIMCON1CLR     /* 0xBF887044 */
  .extern ADCIMCON1SET     /* 0xBF887048 */
  .extern ADCIMCON1INV     /* 0xBF88704C */
  .extern ADCIMCON2        /* 0xBF887050 */
  .extern ADCIMCON2CLR     /* 0xBF887054 */
  .extern ADCIMCON2SET     /* 0xBF887058 */
  .extern ADCIMCON2INV     /* 0xBF88705C */
  .extern ADCIMCON3        /* 0xBF887060 */
  .extern ADCIMCON3CLR     /* 0xBF887064 */
  .extern ADCIMCON3SET     /* 0xBF887068 */
  .extern ADCIMCON3INV     /* 0xBF88706C */
  .extern ADCIMCON4        /* 0xBF887070 */
  .extern ADCIMCON4CLR     /* 0xBF887074 */
  .extern ADCIMCON4SET     /* 0xBF887078 */
  .extern ADCIMCON4INV     /* 0xBF88707C */
  .extern ADCGIRQEN1       /* 0xBF887080 */
  .extern ADCGIRQEN1CLR    /* 0xBF887084 */
  .extern ADCGIRQEN1SET    /* 0xBF887088 */
  .extern ADCGIRQEN1INV    /* 0xBF88708C */
  .extern ADCGIRQEN2       /* 0xBF887090 */
  .extern ADCGIRQEN2CLR    /* 0xBF887094 */
  .extern ADCGIRQEN2SET    /* 0xBF887098 */
  .extern ADCGIRQEN2INV    /* 0xBF88709C */
  .extern ADCCSS1          /* 0xBF8870A0 */
  .extern ADCCSS1CLR       /* 0xBF8870A4 */
  .extern ADCCSS1SET       /* 0xBF8870A8 */
  .extern ADCCSS1INV       /* 0xBF8870AC */
  .extern ADCCSS2          /* 0xBF8870B0 */
  .extern ADCCSS2CLR       /* 0xBF8870B4 */
  .extern ADCCSS2SET       /* 0xBF8870B8 */
  .extern ADCCSS2INV       /* 0xBF8870BC */
  .extern ADCDSTAT1        /* 0xBF8870C0 */
  .extern ADCDSTAT1CLR     /* 0xBF8870C4 */
  .extern ADCDSTAT1SET     /* 0xBF8870C8 */
  .extern ADCDSTAT1INV     /* 0xBF8870CC */
  .extern ADCDSTAT2        /* 0xBF8870D0 */
  .extern ADCDSTAT2CLR     /* 0xBF8870D4 */
  .extern ADCDSTAT2SET     /* 0xBF8870D8 */
  .extern ADCDSTAT2INV     /* 0xBF8870DC */
  .extern ADCCMPEN1        /* 0xBF8870E0 */
  .extern ADCCMPEN1CLR     /* 0xBF8870E4 */
  .extern ADCCMPEN1SET     /* 0xBF8870E8 */
  .extern ADCCMPEN1INV     /* 0xBF8870EC */
  .extern ADCCMP1          /* 0xBF8870F0 */
  .extern ADCCMP1CLR       /* 0xBF8870F4 */
  .extern ADCCMP1SET       /* 0xBF8870F8 */
  .extern ADCCMP1INV       /* 0xBF8870FC */
  .extern ADCCMPEN2        /* 0xBF887100 */
  .extern ADCCMPEN2CLR     /* 0xBF887104 */
  .extern ADCCMPEN2SET     /* 0xBF887108 */
  .extern ADCCMPEN2INV     /* 0xBF88710C */
  .extern ADCCMP2          /* 0xBF887110 */
  .extern ADCCMP2CLR       /* 0xBF887114 */
  .extern ADCCMP2SET       /* 0xBF887118 */
  .extern ADCCMP2INV       /* 0xBF88711C */
  .extern ADCCMPEN3        /* 0xBF887120 */
  .extern ADCCMPEN3CLR     /* 0xBF887124 */
  .extern ADCCMPEN3SET     /* 0xBF887128 */
  .extern ADCCMPEN3INV     /* 0xBF88712C */
  .extern ADCCMP3          /* 0xBF887130 */
  .extern ADCCMP3CLR       /* 0xBF887134 */
  .extern ADCCMP3SET       /* 0xBF887138 */
  .extern ADCCMP3INV       /* 0xBF88713C */
  .extern ADCCMPEN4        /* 0xBF887140 */
  .extern ADCCMPEN4CLR     /* 0xBF887144 */
  .extern ADCCMPEN4SET     /* 0xBF887148 */
  .extern ADCCMPEN4INV     /* 0xBF88714C */
  .extern ADCCMP4          /* 0xBF887150 */
