Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0512mcf064.h
#define _IEC4_AD1D22IE_POSITION                  0x00000000
#define _IEC4_AD1D22IE_MASK                      0x00000001
#define _IEC4_AD1D22IE_LENGTH                    0x00000001

#define _IEC4_AD1D23IE_POSITION                  0x00000001
#define _IEC4_AD1D23IE_MASK                      0x00000002
#define _IEC4_AD1D23IE_LENGTH                    0x00000001

#define _IEC4_AD1D24IE_POSITION                  0x00000002
#define _IEC4_AD1D24IE_MASK                      0x00000004
#define _IEC4_AD1D24IE_LENGTH                    0x00000001

#define _IEC4_AD1D25IE_POSITION                  0x00000003
#define _IEC4_AD1D25IE_MASK                      0x00000008
#define _IEC4_AD1D25IE_LENGTH                    0x00000001

#define _IEC4_AD1D26IE_POSITION                  0x00000004
#define _IEC4_AD1D26IE_MASK                      0x00000010
#define _IEC4_AD1D26IE_LENGTH                    0x00000001

#define _IEC4_AD1D27IE_POSITION                  0x00000005
#define _IEC4_AD1D27IE_MASK                      0x00000020
#define _IEC4_AD1D27IE_LENGTH                    0x00000001

#define _IEC4_AD1D33IE_POSITION                  0x0000000B
#define _IEC4_AD1D33IE_MASK                      0x00000800
#define _IEC4_AD1D33IE_LENGTH                    0x00000001

#define _IEC4_AD1D34IE_POSITION                  0x0000000C
#define _IEC4_AD1D34IE_MASK                      0x00001000
#define _IEC4_AD1D34IE_LENGTH                    0x00000001

#define _IEC4_AD1D35IE_POSITION                  0x0000000D
#define _IEC4_AD1D35IE_MASK                      0x00002000
#define _IEC4_AD1D35IE_LENGTH                    0x00000001

#define _IEC4_AD1D36IE_POSITION                  0x0000000E
#define _IEC4_AD1D36IE_MASK                      0x00004000
#define _IEC4_AD1D36IE_LENGTH                    0x00000001

#define _IEC4_AD1D37IE_POSITION                  0x0000000F
#define _IEC4_AD1D37IE_MASK                      0x00008000
#define _IEC4_AD1D37IE_LENGTH                    0x00000001

#define _IEC4_AD1D38IE_POSITION                  0x00000010
#define _IEC4_AD1D38IE_MASK                      0x00010000
#define _IEC4_AD1D38IE_LENGTH                    0x00000001

#define _IEC4_AD1D39IE_POSITION                  0x00000011
#define _IEC4_AD1D39IE_MASK                      0x00020000
#define _IEC4_AD1D39IE_LENGTH                    0x00000001

#define _IEC4_AD1D40IE_POSITION                  0x00000012
#define _IEC4_AD1D40IE_MASK                      0x00040000
#define _IEC4_AD1D40IE_LENGTH                    0x00000001

#define _IEC4_AD1D41IE_POSITION                  0x00000013
#define _IEC4_AD1D41IE_MASK                      0x00080000
#define _IEC4_AD1D41IE_LENGTH                    0x00000001

#define _IEC4_AD1D45IE_POSITION                  0x00000017
#define _IEC4_AD1D45IE_MASK                      0x00800000
#define _IEC4_AD1D45IE_LENGTH                    0x00000001

#define _IEC4_AD1D46IE_POSITION                  0x00000018
#define _IEC4_AD1D46IE_MASK                      0x01000000
#define _IEC4_AD1D46IE_LENGTH                    0x00000001

#define _IEC4_AD1D47IE_POSITION                  0x00000019
#define _IEC4_AD1D47IE_MASK                      0x02000000
#define _IEC4_AD1D47IE_LENGTH                    0x00000001

#define _IEC4_AD1D48IE_POSITION                  0x0000001A
#define _IEC4_AD1D48IE_MASK                      0x04000000
#define _IEC4_AD1D48IE_LENGTH                    0x00000001

#define _IEC4_AD1D49IE_POSITION                  0x0000001B
#define _IEC4_AD1D49IE_MASK                      0x08000000
#define _IEC4_AD1D49IE_LENGTH                    0x00000001

#define _IEC4_AD1D50IE_POSITION                  0x0000001C
#define _IEC4_AD1D50IE_MASK                      0x10000000
#define _IEC4_AD1D50IE_LENGTH                    0x00000001

#define _IEC4_AD1D51IE_POSITION                  0x0000001D
#define _IEC4_AD1D51IE_MASK                      0x20000000
#define _IEC4_AD1D51IE_LENGTH                    0x00000001

#define _IEC4_AD1D52IE_POSITION                  0x0000001E
#define _IEC4_AD1D52IE_MASK                      0x40000000
#define _IEC4_AD1D52IE_LENGTH                    0x00000001

#define _IEC4_AD1D53IE_POSITION                  0x0000001F
#define _IEC4_AD1D53IE_MASK                      0x80000000
#define _IEC4_AD1D53IE_LENGTH                    0x00000001

#define _IEC4_w_POSITION                         0x00000000
#define _IEC4_w_MASK                             0xFFFFFFFF
#define _IEC4_w_LENGTH                           0x00000020

#define _IEC5_CMP3IE_POSITION                    0x00000000
#define _IEC5_CMP3IE_MASK                        0x00000001
#define _IEC5_CMP3IE_LENGTH                      0x00000001

#define _IEC5_CMP4IE_POSITION                    0x00000001
#define _IEC5_CMP4IE_MASK                        0x00000002
#define _IEC5_CMP4IE_LENGTH                      0x00000001

#define _IEC5_CMP5IE_POSITION                    0x00000002
#define _IEC5_CMP5IE_MASK                        0x00000004
#define _IEC5_CMP5IE_LENGTH                      0x00000001

#define _IEC5_U6EIE_POSITION                     0x00000004
#define _IEC5_U6EIE_MASK                         0x00000010
#define _IEC5_U6EIE_LENGTH                       0x00000001

#define _IEC5_U6RXIE_POSITION                    0x00000005
#define _IEC5_U6RXIE_MASK                        0x00000020
#define _IEC5_U6RXIE_LENGTH                      0x00000001

#define _IEC5_U6TXIE_POSITION                    0x00000006
#define _IEC5_U6TXIE_MASK                        0x00000040
#define _IEC5_U6TXIE_LENGTH                      0x00000001

#define _IEC5_CAN1IE_POSITION                    0x00000007
#define _IEC5_CAN1IE_MASK                        0x00000080
#define _IEC5_CAN1IE_LENGTH                      0x00000001

#define _IEC5_CAN2IE_POSITION                    0x00000008
#define _IEC5_CAN2IE_MASK                        0x00000100
#define _IEC5_CAN2IE_LENGTH                      0x00000001

#define _IEC5_QEI1IE_POSITION                    0x00000009
#define _IEC5_QEI1IE_MASK                        0x00000200
#define _IEC5_QEI1IE_LENGTH                      0x00000001

