Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0512mcf064.h
#define _TRGCON6_DTM_POSITION                    0x00000007
#define _TRGCON6_DTM_MASK                        0x00000080
#define _TRGCON6_DTM_LENGTH                      0x00000001

#define _TRGCON6_STRGSEL_POSITION                0x00000008
#define _TRGCON6_STRGSEL_MASK                    0x00000300
#define _TRGCON6_STRGSEL_LENGTH                  0x00000002

#define _TRGCON6_TRGSEL_POSITION                 0x0000000A
#define _TRGCON6_TRGSEL_MASK                     0x00000C00
#define _TRGCON6_TRGSEL_LENGTH                   0x00000002

#define _TRGCON6_TRGDIV_POSITION                 0x0000000C
#define _TRGCON6_TRGDIV_MASK                     0x0000F000
#define _TRGCON6_TRGDIV_LENGTH                   0x00000004

#define _STRIG6_STRGCMP_POSITION                 0x00000000
#define _STRIG6_STRGCMP_MASK                     0x0000FFFF
#define _STRIG6_STRGCMP_LENGTH                   0x00000010

#define _CAP6_CAP_POSITION                       0x00000000
#define _CAP6_CAP_MASK                           0x0000FFFF
#define _CAP6_CAP_LENGTH                         0x00000010

#define _LEBCON6_CLLEBEN_POSITION                0x0000000A
#define _LEBCON6_CLLEBEN_MASK                    0x00000400
#define _LEBCON6_CLLEBEN_LENGTH                  0x00000001

#define _LEBCON6_FLTLEBEN_POSITION               0x0000000B
#define _LEBCON6_FLTLEBEN_MASK                   0x00000800
#define _LEBCON6_FLTLEBEN_LENGTH                 0x00000001

#define _LEBCON6_PLF_POSITION                    0x0000000C
#define _LEBCON6_PLF_MASK                        0x00001000
#define _LEBCON6_PLF_LENGTH                      0x00000001

#define _LEBCON6_PLR_POSITION                    0x0000000D
#define _LEBCON6_PLR_MASK                        0x00002000
#define _LEBCON6_PLR_LENGTH                      0x00000001

#define _LEBCON6_PHF_POSITION                    0x0000000E
#define _LEBCON6_PHF_MASK                        0x00004000
#define _LEBCON6_PHF_LENGTH                      0x00000001

#define _LEBCON6_PHR_POSITION                    0x0000000F
#define _LEBCON6_PHR_MASK                        0x00008000
#define _LEBCON6_PHR_LENGTH                      0x00000001

#define _LEBDLY6_LEB_POSITION                    0x00000000
#define _LEBDLY6_LEB_MASK                        0x00000FFF
#define _LEBDLY6_LEB_LENGTH                      0x0000000C

#define _AUXCON6_CHOPLEN_POSITION                0x00000000
#define _AUXCON6_CHOPLEN_MASK                    0x00000001
#define _AUXCON6_CHOPLEN_LENGTH                  0x00000001

#define _AUXCON6_CHOPHEN_POSITION                0x00000001
#define _AUXCON6_CHOPHEN_MASK                    0x00000002
#define _AUXCON6_CHOPHEN_LENGTH                  0x00000001

#define _AUXCON6_CHOPSEL_POSITION                0x00000002
#define _AUXCON6_CHOPSEL_MASK                    0x0000003C
#define _AUXCON6_CHOPSEL_LENGTH                  0x00000004

#define _PTMR6_TMR_POSITION                      0x00000000
#define _PTMR6_TMR_MASK                          0x0000FFFF
#define _PTMR6_TMR_LENGTH                        0x00000010

#define _PWMCON7_XPRES_POSITION                  0x00000001
#define _PWMCON7_XPRES_MASK                      0x00000002
#define _PWMCON7_XPRES_LENGTH                    0x00000001

#define _PWMCON7_MTBS_POSITION                   0x00000003
#define _PWMCON7_MTBS_MASK                       0x00000008
#define _PWMCON7_MTBS_LENGTH                     0x00000001

#define _PWMCON7_PTDIR_POSITION                  0x00000004
#define _PWMCON7_PTDIR_MASK                      0x00000010
#define _PWMCON7_PTDIR_LENGTH                    0x00000001

#define _PWMCON7_DTCP_POSITION                   0x00000005
#define _PWMCON7_DTCP_MASK                       0x00000020
#define _PWMCON7_DTCP_LENGTH                     0x00000001

#define _PWMCON7_DTC_POSITION                    0x00000006
#define _PWMCON7_DTC_MASK                        0x000000C0
#define _PWMCON7_DTC_LENGTH                      0x00000002

#define _PWMCON7_ITB_POSITION                    0x00000009
#define _PWMCON7_ITB_MASK                        0x00000200
#define _PWMCON7_ITB_LENGTH                      0x00000001

#define _PWMCON7_ECAM_POSITION                   0x0000000A
#define _PWMCON7_ECAM_MASK                       0x00000C00
#define _PWMCON7_ECAM_LENGTH                     0x00000002

#define _PWMCON7_CLTSTAT_POSITION                0x0000000E
#define _PWMCON7_CLTSTAT_MASK                    0x00004000
#define _PWMCON7_CLTSTAT_LENGTH                  0x00000001

#define _PWMCON7_FLTSTAT_POSITION                0x0000000F
#define _PWMCON7_FLTSTAT_MASK                    0x00008000
#define _PWMCON7_FLTSTAT_LENGTH                  0x00000001

#define _PWMCON7_PWMHIEN_POSITION                0x00000013
#define _PWMCON7_PWMHIEN_MASK                    0x00080000
#define _PWMCON7_PWMHIEN_LENGTH                  0x00000001

#define _PWMCON7_PWMLIEN_POSITION                0x00000014
#define _PWMCON7_PWMLIEN_MASK                    0x00100000
#define _PWMCON7_PWMLIEN_LENGTH                  0x00000001

#define _PWMCON7_TRGIEN_POSITION                 0x00000015
#define _PWMCON7_TRGIEN_MASK                     0x00200000
#define _PWMCON7_TRGIEN_LENGTH                   0x00000001

#define _PWMCON7_CLIEN_POSITION                  0x00000016
#define _PWMCON7_CLIEN_MASK                      0x00400000
#define _PWMCON7_CLIEN_LENGTH                    0x00000001

#define _PWMCON7_FLTIEN_POSITION                 0x00000017
#define _PWMCON7_FLTIEN_MASK                     0x00800000
#define _PWMCON7_FLTIEN_LENGTH                   0x00000001

#define _PWMCON7_PWMHIF_POSITION                 0x0000001B
#define _PWMCON7_PWMHIF_MASK                     0x08000000
#define _PWMCON7_PWMHIF_LENGTH                   0x00000001

#define _PWMCON7_PWMLIF_POSITION                 0x0000001C
#define _PWMCON7_PWMLIF_MASK                     0x10000000
#define _PWMCON7_PWMLIF_LENGTH                   0x00000001

#define _PWMCON7_TRGIF_POSITION                  0x0000001D
#define _PWMCON7_TRGIF_MASK                      0x20000000
#define _PWMCON7_TRGIF_LENGTH                    0x00000001

