Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0512mcf064.h
#define _QEI6IOC_FLTREN_POSITION                 0x0000000E
#define _QEI6IOC_FLTREN_MASK                     0x00004000
#define _QEI6IOC_FLTREN_LENGTH                   0x00000001

#define _QEI6IOC_QCAPEN_POSITION                 0x0000000F
#define _QEI6IOC_QCAPEN_MASK                     0x00008000
#define _QEI6IOC_QCAPEN_LENGTH                   0x00000001

#define _QEI6IOC_HCAPEN_POSITION                 0x00000010
#define _QEI6IOC_HCAPEN_MASK                     0x00010000
#define _QEI6IOC_HCAPEN_LENGTH                   0x00000001

#define _QEI6STAT_IDXIEN_POSITION                0x00000000
#define _QEI6STAT_IDXIEN_MASK                    0x00000001
#define _QEI6STAT_IDXIEN_LENGTH                  0x00000001

#define _QEI6STAT_IDXIRQ_POSITION                0x00000001
#define _QEI6STAT_IDXIRQ_MASK                    0x00000002
#define _QEI6STAT_IDXIRQ_LENGTH                  0x00000001

#define _QEI6STAT_HOMIEN_POSITION                0x00000002
#define _QEI6STAT_HOMIEN_MASK                    0x00000004
#define _QEI6STAT_HOMIEN_LENGTH                  0x00000001

#define _QEI6STAT_HOMIRQ_POSITION                0x00000003
#define _QEI6STAT_HOMIRQ_MASK                    0x00000008
#define _QEI6STAT_HOMIRQ_LENGTH                  0x00000001

#define _QEI6STAT_VELOVIEN_POSITION              0x00000004
#define _QEI6STAT_VELOVIEN_MASK                  0x00000010
#define _QEI6STAT_VELOVIEN_LENGTH                0x00000001

#define _QEI6STAT_VELOVIRQ_POSITION              0x00000005
#define _QEI6STAT_VELOVIRQ_MASK                  0x00000020
#define _QEI6STAT_VELOVIRQ_LENGTH                0x00000001

#define _QEI6STAT_PCIIEN_POSITION                0x00000006
#define _QEI6STAT_PCIIEN_MASK                    0x00000040
#define _QEI6STAT_PCIIEN_LENGTH                  0x00000001

#define _QEI6STAT_PCIIRQ_POSITION                0x00000007
#define _QEI6STAT_PCIIRQ_MASK                    0x00000080
#define _QEI6STAT_PCIIRQ_LENGTH                  0x00000001

#define _QEI6STAT_POSOVIEN_POSITION              0x00000008
#define _QEI6STAT_POSOVIEN_MASK                  0x00000100
#define _QEI6STAT_POSOVIEN_LENGTH                0x00000001

#define _QEI6STAT_POSOVIRQ_POSITION              0x00000009
#define _QEI6STAT_POSOVIRQ_MASK                  0x00000200
#define _QEI6STAT_POSOVIRQ_LENGTH                0x00000001

#define _QEI6STAT_PCLEQIEN_POSITION              0x0000000A
#define _QEI6STAT_PCLEQIEN_MASK                  0x00000400
#define _QEI6STAT_PCLEQIEN_LENGTH                0x00000001

#define _QEI6STAT_PCLEQIRQ_POSITION              0x0000000B
#define _QEI6STAT_PCLEQIRQ_MASK                  0x00000800
#define _QEI6STAT_PCLEQIRQ_LENGTH                0x00000001

#define _QEI6STAT_PCHEQIEN_POSITION              0x0000000C
#define _QEI6STAT_PCHEQIEN_MASK                  0x00001000
#define _QEI6STAT_PCHEQIEN_LENGTH                0x00000001

#define _QEI6STAT_PCHEQIRQ_POSITION              0x0000000D
#define _QEI6STAT_PCHEQIRQ_MASK                  0x00002000
#define _QEI6STAT_PCHEQIRQ_LENGTH                0x00000001

#define _POS6CNT_POSCNT_POSITION                 0x00000000
#define _POS6CNT_POSCNT_MASK                     0xFFFFFFFF
#define _POS6CNT_POSCNT_LENGTH                   0x00000020

#define _POS6HLD_POSHLD_POSITION                 0x00000000
#define _POS6HLD_POSHLD_MASK                     0xFFFFFFFF
#define _POS6HLD_POSHLD_LENGTH                   0x00000020

#define _VEL6CNT_VELCNT_POSITION                 0x00000000
#define _VEL6CNT_VELCNT_MASK                     0xFFFFFFFF
#define _VEL6CNT_VELCNT_LENGTH                   0x00000020

#define _VEL6HLD_VELHLD_POSITION                 0x00000000
#define _VEL6HLD_VELHLD_MASK                     0xFFFFFFFF
#define _VEL6HLD_VELHLD_LENGTH                   0x00000020

#define _INT6TMR_INTTMR_POSITION                 0x00000000
#define _INT6TMR_INTTMR_MASK                     0xFFFFFFFF
#define _INT6TMR_INTTMR_LENGTH                   0x00000020

#define _INT6HLD_INTHLD_POSITION                 0x00000000
#define _INT6HLD_INTHLD_MASK                     0xFFFFFFFF
#define _INT6HLD_INTHLD_LENGTH                   0x00000020

#define _INDX6CNT_INDXCNT_POSITION               0x00000000
#define _INDX6CNT_INDXCNT_MASK                   0xFFFFFFFF
#define _INDX6CNT_INDXCNT_LENGTH                 0x00000020

#define _INDX6HLD_INDXHLD_POSITION               0x00000000
#define _INDX6HLD_INDXHLD_MASK                   0xFFFFFFFF
#define _INDX6HLD_INDXHLD_LENGTH                 0x00000020

#define _QEI6ICC_QEIICC_POSITION                 0x00000000
#define _QEI6ICC_QEIICC_MASK                     0xFFFFFFFF
#define _QEI6ICC_QEIICC_LENGTH                   0x00000020

#define _QEI6CMPL_QEICMPL_POSITION               0x00000000
#define _QEI6CMPL_QEICMPL_MASK                   0xFFFFFFFF
#define _QEI6CMPL_QEICMPL_LENGTH                 0x00000020

#define _CMSTAT_C1OUT_POSITION                   0x00000000
#define _CMSTAT_C1OUT_MASK                       0x00000001
#define _CMSTAT_C1OUT_LENGTH                     0x00000001

#define _CMSTAT_C2OUT_POSITION                   0x00000001
#define _CMSTAT_C2OUT_MASK                       0x00000002
#define _CMSTAT_C2OUT_LENGTH                     0x00000001

#define _CMSTAT_C3OUT_POSITION                   0x00000002
#define _CMSTAT_C3OUT_MASK                       0x00000004
#define _CMSTAT_C3OUT_LENGTH                     0x00000001

#define _CMSTAT_C4OUT_POSITION                   0x00000003
#define _CMSTAT_C4OUT_MASK                       0x00000008
#define _CMSTAT_C4OUT_LENGTH                     0x00000001

#define _CMSTAT_C5OUT_POSITION                   0x00000004
#define _CMSTAT_C5OUT_MASK                       0x00000010
#define _CMSTAT_C5OUT_LENGTH                     0x00000001

#define _CMSTAT_SIDL_POSITION                    0x0000000D
#define _CMSTAT_SIDL_MASK                        0x00002000
#define _CMSTAT_SIDL_LENGTH                      0x00000001

#define _CMSTAT_C1EVT_POSITION                   0x00000010
#define _CMSTAT_C1EVT_MASK                       0x00010000
#define _CMSTAT_C1EVT_LENGTH                     0x00000001

