Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0512mcf064.h
#define _C4RXOVF_RXOVF2_POSITION                 0x00000002
#define _C4RXOVF_RXOVF2_MASK                     0x00000004
#define _C4RXOVF_RXOVF2_LENGTH                   0x00000001

#define _C4RXOVF_RXOVF3_POSITION                 0x00000003
#define _C4RXOVF_RXOVF3_MASK                     0x00000008
#define _C4RXOVF_RXOVF3_LENGTH                   0x00000001

#define _C4RXOVF_RXOVF4_POSITION                 0x00000004
#define _C4RXOVF_RXOVF4_MASK                     0x00000010
#define _C4RXOVF_RXOVF4_LENGTH                   0x00000001

#define _C4RXOVF_RXOVF5_POSITION                 0x00000005
#define _C4RXOVF_RXOVF5_MASK                     0x00000020
#define _C4RXOVF_RXOVF5_LENGTH                   0x00000001

#define _C4RXOVF_RXOVF6_POSITION                 0x00000006
#define _C4RXOVF_RXOVF6_MASK                     0x00000040
#define _C4RXOVF_RXOVF6_LENGTH                   0x00000001

#define _C4RXOVF_RXOVF7_POSITION                 0x00000007
#define _C4RXOVF_RXOVF7_MASK                     0x00000080
#define _C4RXOVF_RXOVF7_LENGTH                   0x00000001

#define _C4RXOVF_RXOVF8_POSITION                 0x00000008
#define _C4RXOVF_RXOVF8_MASK                     0x00000100
#define _C4RXOVF_RXOVF8_LENGTH                   0x00000001

#define _C4RXOVF_RXOVF9_POSITION                 0x00000009
#define _C4RXOVF_RXOVF9_MASK                     0x00000200
#define _C4RXOVF_RXOVF9_LENGTH                   0x00000001

#define _C4RXOVF_RXOVF10_POSITION                0x0000000A
#define _C4RXOVF_RXOVF10_MASK                    0x00000400
#define _C4RXOVF_RXOVF10_LENGTH                  0x00000001

#define _C4RXOVF_RXOVF11_POSITION                0x0000000B
#define _C4RXOVF_RXOVF11_MASK                    0x00000800
#define _C4RXOVF_RXOVF11_LENGTH                  0x00000001

#define _C4RXOVF_RXOVF12_POSITION                0x0000000C
#define _C4RXOVF_RXOVF12_MASK                    0x00001000
#define _C4RXOVF_RXOVF12_LENGTH                  0x00000001

#define _C4RXOVF_RXOVF13_POSITION                0x0000000D
#define _C4RXOVF_RXOVF13_MASK                    0x00002000
#define _C4RXOVF_RXOVF13_LENGTH                  0x00000001

#define _C4RXOVF_RXOVF14_POSITION                0x0000000E
#define _C4RXOVF_RXOVF14_MASK                    0x00004000
#define _C4RXOVF_RXOVF14_LENGTH                  0x00000001

#define _C4RXOVF_RXOVF15_POSITION                0x0000000F
#define _C4RXOVF_RXOVF15_MASK                    0x00008000
#define _C4RXOVF_RXOVF15_LENGTH                  0x00000001

#define _C4RXOVF_w_POSITION                      0x00000000
#define _C4RXOVF_w_MASK                          0xFFFFFFFF
#define _C4RXOVF_w_LENGTH                        0x00000020

#define _C4TMR_CANTSPRE_POSITION                 0x00000000
#define _C4TMR_CANTSPRE_MASK                     0x0000FFFF
#define _C4TMR_CANTSPRE_LENGTH                   0x00000010

#define _C4TMR_CANTS_POSITION                    0x00000010
#define _C4TMR_CANTS_MASK                        0xFFFF0000
#define _C4TMR_CANTS_LENGTH                      0x00000010

#define _C4TMR_w_POSITION                        0x00000000
#define _C4TMR_w_MASK                            0xFFFFFFFF
#define _C4TMR_w_LENGTH                          0x00000020

#define _C4RXM0_EID_POSITION                     0x00000000
#define _C4RXM0_EID_MASK                         0x0003FFFF
#define _C4RXM0_EID_LENGTH                       0x00000012

#define _C4RXM0_MIDE_POSITION                    0x00000013
#define _C4RXM0_MIDE_MASK                        0x00080000
#define _C4RXM0_MIDE_LENGTH                      0x00000001

#define _C4RXM0_SID_POSITION                     0x00000015
#define _C4RXM0_SID_MASK                         0xFFE00000
#define _C4RXM0_SID_LENGTH                       0x0000000B

#define _C4RXM0_w_POSITION                       0x00000000
#define _C4RXM0_w_MASK                           0xFFFFFFFF
#define _C4RXM0_w_LENGTH                         0x00000020

#define _C4RXM1_EID_POSITION                     0x00000000
#define _C4RXM1_EID_MASK                         0x0003FFFF
#define _C4RXM1_EID_LENGTH                       0x00000012

#define _C4RXM1_MIDE_POSITION                    0x00000013
#define _C4RXM1_MIDE_MASK                        0x00080000
#define _C4RXM1_MIDE_LENGTH                      0x00000001

#define _C4RXM1_SID_POSITION                     0x00000015
#define _C4RXM1_SID_MASK                         0xFFE00000
#define _C4RXM1_SID_LENGTH                       0x0000000B

#define _C4RXM1_w_POSITION                       0x00000000
#define _C4RXM1_w_MASK                           0xFFFFFFFF
#define _C4RXM1_w_LENGTH                         0x00000020

#define _C4RXM2_EID_POSITION                     0x00000000
#define _C4RXM2_EID_MASK                         0x0003FFFF
#define _C4RXM2_EID_LENGTH                       0x00000012

#define _C4RXM2_MIDE_POSITION                    0x00000013
#define _C4RXM2_MIDE_MASK                        0x00080000
#define _C4RXM2_MIDE_LENGTH                      0x00000001

#define _C4RXM2_SID_POSITION                     0x00000015
#define _C4RXM2_SID_MASK                         0xFFE00000
#define _C4RXM2_SID_LENGTH                       0x0000000B

#define _C4RXM2_w_POSITION                       0x00000000
#define _C4RXM2_w_MASK                           0xFFFFFFFF
#define _C4RXM2_w_LENGTH                         0x00000020

#define _C4RXM3_EID_POSITION                     0x00000000
#define _C4RXM3_EID_MASK                         0x0003FFFF
#define _C4RXM3_EID_LENGTH                       0x00000012

#define _C4RXM3_MIDE_POSITION                    0x00000013
#define _C4RXM3_MIDE_MASK                        0x00080000
#define _C4RXM3_MIDE_LENGTH                      0x00000001

#define _C4RXM3_SID_POSITION                     0x00000015
#define _C4RXM3_SID_MASK                         0xFFE00000
#define _C4RXM3_SID_LENGTH                       0x0000000B

#define _C4RXM3_w_POSITION                       0x00000000
#define _C4RXM3_w_MASK                           0xFFFFFFFF
#define _C4RXM3_w_LENGTH                         0x00000020

#define _C4FLTCON0_FSEL0_POSITION                0x00000000
#define _C4FLTCON0_FSEL0_MASK                    0x0000001F
#define _C4FLTCON0_FSEL0_LENGTH                  0x00000005

#define _C4FLTCON0_MSEL0_POSITION                0x00000005
#define _C4FLTCON0_MSEL0_MASK                    0x00000060
#define _C4FLTCON0_MSEL0_LENGTH                  0x00000002

#define _C4FLTCON0_FLTEN0_POSITION               0x00000007
#define _C4FLTCON0_FLTEN0_MASK                   0x00000080
#define _C4FLTCON0_FLTEN0_LENGTH                 0x00000001

#define _C4FLTCON0_FSEL1_POSITION                0x00000008
#define _C4FLTCON0_FSEL1_MASK                    0x00001F00
#define _C4FLTCON0_FSEL1_LENGTH                  0x00000005

#define _C4FLTCON0_MSEL1_POSITION                0x0000000D
#define _C4FLTCON0_MSEL1_MASK                    0x00006000
#define _C4FLTCON0_MSEL1_LENGTH                  0x00000002

